Repository: VanshMomaya7/redact_app_final
Catalog: lib/l10n/app_*.arb
Languages: gu, ur

# alternaria_pomegranate
source: Alternaria in pomegranate can be controlled by applying fungicides like Mancozeb or Chlorothalonil, which help in preventing fungal growth. Prune infected branches and remove fallen leaves to reduce the spread of the disease. Ensure good air circulation around the plant to avoid excessive moisture buildup. It is also essential to maintain proper irrigation practices and avoid overhead watering to minimize the spread of spores. Crop rotation with non-susceptible crops and using disease-free planting materials can also help in preventing future outbreaks.
gu: દાડમમાં અલ્ટરનેરિયા નિયંત્રિત કરવા માટે મેનકોઝેબ અથવા ક્લોરોથાલોનિલ જેવા ફૂગનાશકોનો ઉપયોગ કરો, જે ફૂગના વિકાસને રોકવામાં મદદ કરે છે. રોગના પ્રસારને ઘટાડવા માટે સંક્રમિત ડાળીઓ કાપી નાખો અને પડી ગયેલા પાન દૂર કરો. છોડની આસપાસ હવાની સારી પ્રવાહ હોય તે માટે સુનિશ્ચિત કરો જેથી અતિશય ભેજ ન બને. યોગ્ય સિંચાઈ પદ્ધતિઓ જાળવવી અને ફૂગના બીજાણુઓના પ્રસારને ઘટાડવા માટે ઓવરહેડ સિંચાઈથી બચવું આવશ્યક છે. સંવેદનશીલ ન હોય તેવી પાક સાથે પાક ફેરપાળું કરવાથી અને રોગમુક્ત વાવેતર સામગ્રીના ઉપયોગથી ભવિષ્યમાં રોગ ફાટી નીકળવાથી અટકાવી શકાય છે.
ur: انار میں الٹرناریا کو کنٹرول کرنے کے لیے مینکوزیب یا کلورو تھالونل جیسے فنگسائڈز کا استعمال کریں، جو فنگس کی نشوونما کو روکنے میں مدد کرتے ہیں۔ بیماری کے پھیلاؤ کو کم کرنے کے لیے متاثرہ شاخوں کو تراشیں اور گرے ہوئے پتوں کو ہٹا دیں۔ پودے کے ارد گرد ہوا کی اچھی گردش کو یقینی بنائیں تاکہ زیادہ نمی پیدا نہ ہو۔ مناسب آبپاشی کے طریقوں کو برقرار رکھنا اور فنگس کے پھیلاؤ کو کم کرنے کے لیے اوور ہیڈ آبپاشی سے گریز کرنا ضروری ہے۔ غیر حساس فصلوں کے ساتھ فصل کی گردش اور بیماری سے پاک پودے کے مواد کا استعمال مستقبل کے پھیلاؤ کو روکنے میں مدد کر سکتا ہے۔

# anthracnose_pomegranate
source: Anthracnose in pomegranate is controlled by applying systemic fungicides such as Propiconazole or copper-based fungicides. Remove and dispose of infected fruits, leaves, and branches to reduce disease spread. Pruning of affected areas is recommended. Ensure proper drainage to prevent waterlogging and minimize humidity, as this disease thrives in moist environments. In severe cases, a second application of fungicide may be needed, particularly during the flowering stage. Also, avoid plant stress from excessive irrigation or nutrient imbalances. Using disease-resistant varieties can help reduce the occurrence of anthracnose.
gu: દાડમમાં એન્થ્રાક્નોઝ નિયંત્રિત કરવા માટે પ્રોપિકોનાઝોલ જેવા સિસ્ટમિક ફૂગનાશકો અથવા તામ્ર આધારિત ફૂગનાશકોનો ઉપયોગ કરો. રોગના પ્રસારને ઘટાડવા માટે સંક્રમિત ફળો, પાંદડા અને ડાળીઓ દૂર કરો અને નાશ કરો. અસરગ્રસ્ત વિસ્તારોની કાપકણી કરવી સલામત છે. ભેજને ટાળવા માટે યોગ્ય ડ્રેનેજ સુનિશ્ચિત કરો, કારણ કે આ રોગ ભેજવાળા વાતાવરણમાં વધે છે. ગંભીર કિસ્સાઓમાં, ફૂલવાના તબક્કા દરમિયાન ખાસ કરીને ફૂગનાશકના બીજા ઉપયોગની જરૂર પડી શકે છે. છોડને વધુ સિંચાઈ અથવા પોષણના અસમતોલથી પડતા તાણથી બચાવવું પણ મહત્વપૂર્ણ છે. રોગપ્રતિરોધક જાતોનો ઉપયોગ એન્થ્રાક્નોઝની ઘટનાઓને ઘટાડવામાં મદદ કરે છે.
ur: انار میں اینتھراکنوز کو کنٹرول کرنے کے لیے پروپیکونازول جیسے سسٹمک فنگسائڈز یا تانبا پر مبنی فنگسائڈز کا استعمال کریں۔ بیماری کے پھیلاؤ کو کم کرنے کے لیے متاثرہ پھلوں، پتوں، اور شاخوں کو ہٹا دیں اور ضائع کر دیں۔ متاثرہ حصوں کو تراشنا تجویز کیا جاتا ہے۔ زیادہ نمی کو روکنے کے لیے مناسب نکاسی کو یقینی بنائیں، کیونکہ یہ بیماری مرطوب ماحول میں پروان چڑھتی ہے۔ شدید معاملات میں، خاص طور پر پھولوں کے مرحلے کے دوران فنگسائڈ کی ایک اور خوراک کی ضرورت پڑ سکتی ہے۔ اضافی آبپاشی یا غذائی عدم توازن سے پودے کو تناؤ سے بچانا بھی ضروری ہے۔ بیماری سے بچنے والی اقسام کا استعمال اینتھراکنوز کے واقعات کو کم کرنے میں مدد کرتا ہے۔

# bacterial_blight_in_cotton
source: Bacterial blight in cotton can be managed by using resistant cotton varieties and maintaining field sanitation. Apply copper-based bactericides to prevent bacterial infection. Avoid overhead irrigation to prevent moisture buildup, which promotes bacterial growth. Ensure proper spacing between plants to improve airflow and reduce humidity around the cotton plants. Regularly remove and dispose of infected plant material. Proper weed management also reduces the chances of bacterial spread. Crop rotation with non-host crops is advisable to minimize re-infection. It is also essential to monitor and manage insect vectors that may spread the bacteria.
gu: કપાસમાં બેક્ટેરિયલ બ્લાઈટને રોગપ્રતિરોધક કપાસની જાતોનો ઉપયોગ કરીને અને ખેતરની સફાઈ જાળવીને નિયંત્રિત કરી શકાય છે. બેક્ટેરિયલ ચેપને અટકાવવા માટે તામ્ર આધારિત બેક્ટેરિસાઇડનો ઉપયોગ કરો. ભેજના જમાવટને રોકવા માટે ઓવરહેડ સિંચાઈથી બચો, જે બેક્ટેરિયાના વિકાસને પ્રોત્સાહન આપે છે. કપાસના છોડની આસપાસ હવાની પ્રવાહ સુધારવા અને ભેજને ઘટાડવા માટે છોડ વચ્ચે યોગ્ય અંતર સુનિશ્ચિત કરો. સંક્રમિત છોડની સામગ્રીને નિયમિત રીતે દૂર કરો અને નાશ કરો. ગંદકીનું યોગ્ય સંચાલન બેક્ટેરિયાના પ્રસારની શક્યતાઓને ઘટાડે છે. પુન: ચેપની શક્યતાઓને ઘટાડવા માટે ગેર-મકાનદારો પાક સાથે પાક ફેરપાળું સલાહપ્રદ છે. બેક્ટેરિયાના પ્રસાર કરનારા જીવાતોનું પણ યોગ્ય રીતે નિરીક્ષણ અને વ્યવસ્થાપન કરવું જરૂરી છે.
ur: کپاس میں بیکٹیریل بلائٹ کو مزاحم کپاس کی اقسام استعمال کر کے اور کھیت کی صفائی برقرار رکھ کر قابو پایا جا سکتا ہے۔ بیکٹیریل انفیکشن کو روکنے کے لیے تانبا پر مبنی بیکٹیریا سائیڈز لگائیں۔ نمی کی تشکیل کو روکنے کے لیے اوور ہیڈ آبپاشی سے گریز کریں، جو بیکٹیریا کی نشوونما کو فروغ دیتا ہے۔ کپاس کے پودوں کے ارد گرد ہوا کے بہاؤ کو بہتر بنانے اور نمی کو کم کرنے کے لیے پودوں کے درمیان مناسب وقفہ یقینی بنائیں۔ متاثرہ پودوں کے مواد کو باقاعدگی سے ہٹا کر ضائع کریں۔ جڑی بوٹیوں کا مناسب انتظام بھی بیکٹیریا کے پھیلاؤ کے امکانات کو کم کرتا ہے۔ دوبارہ انفیکشن کو کم کرنے کے لیے غیر میزبان فصلوں کے ساتھ فصل کی گردش کا مشورہ دیا جاتا ہے۔ یہ بھی ضروری ہے کہ بیکٹیریا کے پھیلاؤ کا باعث بننے والے کیڑوں کو مانیٹر اور کنٹرول کیا جائے۔

# bacterial_blight_pomegranate
source: Bacterial blight in pomegranate can be controlled by pruning and removing infected branches and leaves. Apply copper-based bactericides to reduce bacterial growth, and ensure proper field sanitation. Maintain proper water management practices to avoid excess moisture around the plant, as bacteria thrive in humid conditions. Drip irrigation is recommended to reduce water splashing and bacterial spread. It is crucial to keep the area around the tree clean by removing fallen leaves and fruit. Infected plants should be destroyed to prevent the spread to healthy ones. Using resistant varieties can further help control the disease.
gu: દાડમમાં બેક્ટેરિયલ બ્લાઈટ નિયંત્રિત કરવા માટે સંક્રમિત ડાળીઓ અને પાંદડાઓની કાપકણી અને દૂર કરવું આવશ્યક છે. બેક્ટેરિયાના વૃદ્ધિને ઘટાડવા માટે તામ્ર આધારિત બેક્ટેરિસાઇડનો ઉપયોગ કરો અને ખેતરની યોગ્ય સફાઈ જાળવો. છોડની આસપાસ ભેજ ટાળવા માટે યોગ્ય પાણી વ્યવસ્થાપન પદ્ધતિઓ જાળવવી જરૂરી છે, કારણ કે બેક્ટેરિયા ભેજવાળા પરિસ્થિતિમાં ફૂલતા થાય છે. બેક્ટેરિયાના પ્રસારને ઘટાડવા માટે ડ્રિપ સિંચાઈની ભલામણ કરવામાં આવે છે. પડી ગયેલા પાંદડા અને ફળોને દૂર કરીને અને આસપાસનું ક્ષેત્ર સાફ રાખવું આવશ્યક છે. સંક્રમિત છોડને નાશ કરવામાં આવશે જેથી તે સ્વસ્થ ઝાડમાં ફેલાય નહીં. રોગપ્રતિરોધક જાતોનો ઉપયોગ રોગ નિયંત્રણમાં વધુ મદદરૂપ થઈ શકે છે.
ur: انار میں بیکٹیریل بلائٹ کو کنٹرول کرنے کے لیے متاثرہ شاخوں اور پتوں کو تراشنا اور ہٹانا ضروری ہے۔ بیکٹیریا کی نشوونما کو کم کرنے کے لیے تانبا پر مبنی بیکٹیریا سائیڈز کا استعمال کریں اور کھیت کی مناسب صفائی کو یقینی بنائیں۔ پودے کے ارد گرد نمی سے بچنے کے لیے مناسب پانی کے انتظام کو برقرار رکھیں، کیونکہ بیکٹیریا مرطوب حالات میں پروان چڑھتے ہیں۔ پانی کے چھینٹے اور بیکٹیریا کے پھیلاؤ کو کم کرنے کے لیے ڈرپ آبپاشی کی سفارش کی جاتی ہے۔ گرے ہوئے پتوں اور پھلوں کو ہٹا کر اور درخت کے ارد گرد کے علاقے کو صاف رکھنا بہت ضروری ہے۔ متاثرہ پودوں کو تباہ کر دینا چاہیے تاکہ وہ صحت مند پودوں میں نہ پھیلیں۔ بیماری سے بچنے والی اقسام کا استعمال بیماری کو کنٹرول کرنے میں مزید مددگار ثابت ہو سکتا ہے۔

# bacterial_blight_in_rice
source: Bacterial blight in rice can be managed by using resistant rice varieties. Apply copper-based bactericides early in the growing season for effective control. Avoid overhead irrigation, as it can spread the bacteria through water droplets. Maintain proper field drainage to prevent water stagnation, which encourages bacterial growth. Destroy infected plants promptly and practice crop rotation to reduce the risk of reinfection. Proper spacing of rice plants helps with airflow and minimizes the spread of the disease. Avoid planting in fields that had bacterial blight previously, as the bacteria can persist in soil for years.
gu: ચોખામાં બેક્ટેરિયલ બ્લાઈટ રોગપ્રતિરોધક ચોખાની જાતોનો ઉપયોગ કરીને નિયંત્રિત કરી શકાય છે. અસરકારક નિયંત્રણ માટે સીઝનની શરૂઆતમાં તામ્ર આધારિત બેક્ટેરિસાઇડ લાગુ કરો. બેક્ટેરિયાને પાણીના ટીપાં દ્વારા ફેલાતા અટકાવવા માટે ઓવરહેડ સિંચાઈથી બચો. પાણીના ભરાવને રોકવા માટે યોગ્ય ખેતરના ડ્રેનેજને જાળવો, જે બેક્ટેરિયાના વિકાસને ઉત્તેજન આપે છે. સંક્રમિત છોડને તરત જ નાશ કરો અને પુન: ચેપના જોખમને ઘટાડવા માટે પાક ફેરપાળું પાળો. ચોખાના છોડ વચ્ચે યોગ્ય અંતર હવાની પ્રવાહ માટે મદદરૂપ છે અને રોગના પ્રસારને ઘટાડે છે. તેવા ખેતરોમાં વાવેતર ટાળો જ્યાં અગાઉ બેક્ટેરિયલ બ્લાઈટ થયેલું હોય, કારણ કે બેક્ટેરિયા ઘણા વર્ષો સુધી માટીમાં ટકી શકે છે.
ur: چاول میں بیکٹیریل بلائٹ کو مزاحم چاول کی اقسام کا استعمال کر کے قابو پایا جا سکتا ہے۔ مؤثر کنٹرول کے لیے بڑھتے ہوئے موسم کے شروع میں تانبا پر مبنی بیکٹیریا سائیڈز لگائیں۔ بیکٹیریا کو پانی کے قطروں سے پھیلنے سے روکنے کے لیے اوور ہیڈ آبپاشی سے گریز کریں۔ پانی کے جمع ہونے کو روکنے کے لیے مناسب نکاسی کو برقرار رکھیں، جو بیکٹیریا کی نشوونما کو فروغ دیتا ہے۔ متاثرہ پودوں کو فوراً ہٹا دیں اور دوبارہ انفیکشن کے خطرے کو کم کرنے کے لیے فصل کی گردش پر عمل کریں۔ چاول کے پودوں کا مناسب فاصلہ ہوا کے بہاؤ کو بہتر بنانے میں مدد کرتا ہے اور بیماری کے پھیلاؤ کو کم کرتا ہے۔ ان کھیتوں میں دوبارہ بوائی سے گریز کریں جہاں پہلے بیکٹیریل بلائٹ موجود تھی، کیونکہ بیکٹیریا مٹی میں سالوں تک زندہ رہ سکتے ہیں۔

# brownspot_rice
source: Brownspot in rice can be controlled by applying fungicides such as Tricyclazole or Carbendazim during the early stages of infection. These fungicides help to manage fungal growth and reduce the spread of the disease. Ensure proper irrigation management, as waterlogging promotes the growth of the fungus. Remove and destroy infected leaves and debris. Crop rotation with non-susceptible crops helps reduce the disease's recurrence. Avoid over-fertilizing rice plants, as this can create favorable conditions for fungal infections. Selecting resistant rice varieties and maintaining good plant nutrition also aid in reducing the incidence of brownspot.
gu: ચોખામાં બ્રાઉનસ્પોટને ટ્રાયસાયક્લાઝોલ અથવા કાર્બેન્ડાઝિમ જેવા ફૂગનાશકના ઉપયોગ દ્વારા નિયંત્રિત કરી શકાય છે. આ ફૂગનાશક ફૂગના વિકાસને નિયંત્રિત કરવામાં અને રોગના પ્રસારને ઘટાડવામાં મદદ કરે છે. યોગ્ય સિંચાઈ વ્યવસ્થાપન સુનિશ્ચિત કરો, કારણ કે પાણીના ભરાવાથી ફૂગનું વિકાસ થાય છે. સંક્રમિત પાંદડા અને કચરાને દૂર કરો અને નાશ કરો. સંવેદનશીલ ન હોય તેવી પાક સાથે પાક ફેરપાળું કરવું રોગની પુનરાવૃત્તિ ઘટાડે છે. ચોખાના છોડને વધુ ખાતર આપવું ટાળો, કારણ કે તે ફૂગ ચેપ માટે અનુકૂળ પરિસ્થિતિ બનાવી શકે છે. રોગપ્રતિરોધક ચોખાની જાતો પસંદ કરવી અને સારું પોષણ જાળવવું બ્રાઉનસ્પોટની ઘટનાઓને ઘટાડવામાં મદદ કરે છે.
ur: چاول میں براؤن اسپاٹ کو ٹرائیسائکلوزول یا کاربینڈیازم جیسے فنگسائڈز کو ابتدائی مرحلے میں لگاکر کنٹرول کیا جا سکتا ہے۔ یہ فنگسائڈز فنگس کی نشوونما کو کنٹرول کرنے اور بیماری کے پھیلاؤ کو کم کرنے میں مدد کرتے ہیں۔ مناسب آبپاشی کے انتظام کو یقینی بنائیں، کیونکہ پانی کا جمع ہونا فنگس کی نشوونما کو فروغ دیتا ہے۔ متاثرہ پتوں اور ملبے کو ہٹائیں اور ضائع کریں۔ غیر حساس فصلوں کے ساتھ فصل کی گردش بیماری کی دوبارہ موجودگی کو کم کرنے میں مدد کرتی ہے۔ چاول کے پودوں کو زیادہ کھاد نہ دیں، کیونکہ اس سے فنگل انفیکشن کے لیے سازگار حالات پیدا ہو سکتے ہیں۔ مزاحم چاول کی اقسام کا انتخاب کرنا اور اچھی غذائیت کو برقرار رکھنا براؤن اسپاٹ کے واقعات کو کم کرنے میں مددگار ثابت ہوتا ہے۔

# cercospora_pomegranate
source: Cercospora in pomegranate can be managed by applying fungicides like Propiconazole or copper-based fungicides. These fungicides are effective in controlling fungal infections and reducing the spread of the disease. Prune and remove infected leaves and branches to limit the spread of the fungus. Maintain proper irrigation practices and ensure good drainage around the plant to prevent excess moisture, which fosters fungal growth. Crop rotation with resistant varieties or non-susceptible crops can reduce the likelihood of re-infection. Proper spacing between trees helps improve airflow, reducing the conditions that favor fungal infections.
gu: દાડમમાં સર્કોસ્પોરાને પ્રોપિકોનાઝોલ અથવા તામ્ર આધારિત ફૂગનાશકોના ઉપયોગ દ્વારા નિયંત્રિત કરી શકાય છે. આ ફૂગનાશક ફૂગ ચેપને નિયંત્રિત કરવા અને રોગના પ્રસારને ઘટાડવામાં અસરકારક છે. ફૂગના પ્રસારને મર્યાદિત કરવા માટે સંક્રમિત પાંદડા અને ડાળીઓની કાપકણી અને દૂર કરવી આવશ્યક છે. વધુ ભેજને અટકાવવા માટે યોગ્ય સિંચાઈ પદ્ધતિઓ જાળવો અને છોડની આસપાસ યોગ્ય ડ્રેનેજ સુનિશ્ચિત કરો. રોગપ્રતિરોધક જાતો અથવા ગેર-સંવેદનશીલ પાક સાથે પાક ફેરપાળું કરવાથી પુન: ચેપ થવાની સંભાવના ઘટાડે છે. વૃક્ષો વચ્ચે યોગ્ય અંતર ફૂગ ચેપ માટે અનુકૂળ પરિસ્થિતિઓને ઘટાડે છે.
ur: انار میں سرکوسپورا کو پروپیکونازول یا تانبا پر مبنی فنگسائڈز کا استعمال کرتے ہوئے کنٹرول کیا جا سکتا ہے۔ یہ فنگسائڈز فنگل انفیکشن کو کنٹرول کرنے اور بیماری کے پھیلاؤ کو کم کرنے میں مؤثر ہیں۔ فنگس کے پھیلاؤ کو محدود کرنے کے لیے متاثرہ پتوں اور شاخوں کو تراشنا اور ہٹانا ضروری ہے۔ اضافی نمی سے بچنے کے لیے مناسب آبپاشی کے طریقوں کو برقرار رکھیں اور پودے کے ارد گرد نکاسی کو یقینی بنائیں۔ مزاحم اقسام یا غیر حساس فصلوں کے ساتھ فصل کی گردش دوبارہ انفیکشن کے امکانات کو کم کر سکتی ہے۔ درختوں کے درمیان مناسب فاصلہ ہوا کے بہاؤ کو بہتر بنانے میں مدد کرتا ہے، جو فنگس انفیکشن کی حمایت کرنے والے حالات کو کم کرتا ہے۔

# lemoncroton
source: Lemon croton, a fungal disease affecting various crops, can be managed with fungicides like Thiophanate-methyl or Chlorothalonil. These fungicides help control fungal growth and prevent further spread. Ensure proper plant spacing and airflow around the plants to minimize moisture buildup. Maintain proper soil drainage to prevent waterlogging, which favors fungal growth. Regularly inspect the plants and remove infected leaves or branches. Proper sanitation practices, such as cleaning tools and equipment after use, can prevent the spread of the fungus. Avoid planting crops in areas where lemon croton has previously been an issue to reduce recurrence.
gu: લેમનક્રોટન, જે વિવિધ પાકને અસર કરે છે, તેને થાયોફેનેટ-મિથાઈલ અથવા ક્લોરોથાલોનિલ જેવા ફૂગનાશકના ઉપયોગ દ્વારા નિયંત્રિત કરી શકાય છે. આ ફૂગનાશક ફૂગના વિકાસને નિયંત્રિત કરવા અને વધુ પ્રસાર અટકાવવા માટે મદદ કરે છે. ઝાડની આસપાસ યોગ્ય અંતર અને હવાની પ્રવાહ સુનિશ્ચિત કરો, જે ભેજને ઘટાડે છે. પાણીના ભરાવને રોકવા માટે યોગ્ય માટી ડ્રેનેજ જાળવો. છોડનું નિયમિત નિરીક્ષણ કરો અને સંક્રમિત પાંદડા અથવા ડાળીઓ દૂર કરો. સ્વચ્છતા પદ્ધતિઓ, જેમ કે સાધનો સાફ રાખવા, ફૂગના પ્રસારને અટકાવવામાં મદદ કરી શકે છે. તે વિસ્તારોમાં પાક વાવેતર ટાળો જ્યાં અગાઉ લેમનક્રોટનની સમસ્યા થઈ હતી.
ur: لیموں کروٹن، جو مختلف فصلوں کو متاثر کرنے والی فنگل بیماری ہے، کو تھیوفینیٹ میتھائل یا کلورو تھیالونیل جیسے فنگسائڈز کے استعمال سے کنٹرول کیا جا سکتا ہے۔ یہ فنگسائڈز فنگس کی نشوونما کو کنٹرول کرنے اور مزید پھیلاؤ کو روکنے میں مدد کرتے ہیں۔ پودوں کے ارد گرد مناسب فاصلہ اور ہوا کے بہاؤ کو یقینی بنائیں تاکہ نمی کم ہو۔ پانی کے جمع ہونے کو روکنے کے لیے مناسب مٹی کی نکاسی کو برقرار رکھیں۔ پودوں کا باقاعدہ معائنہ کریں اور متاثرہ پتوں یا شاخوں کو ہٹا دیں۔ صفائی کے طریقے، جیسے کہ اوزار صاف رکھنا، فنگس کے پھیلاؤ کو روکنے میں مدد کر سکتے ہیں۔ ان علاقوں میں فصلیں لگانے سے گریز کریں جہاں پہلے لیموں کروٹن کا مسئلہ رہا ہو۔

# tungro_rice
source: Tungro in rice is caused by a virus transmitted by insect vectors, mainly the green leafhopper. Control of tungro involves using resistant rice varieties and destroying infected plants. Apply insecticides to control the vector and reduce virus transmission. Ensure proper field management practices, such as controlling weeds that may serve as alternate hosts for the leafhopper. Infected plants should be removed and destroyed immediately to limit the spread of the disease. Crop rotation with non-host crops is advisable to reduce the recurrence of the disease. Avoid planting rice in areas with a history of tungro infestation.
gu: ચોખામાં ટુન્ગ્રો વાયરસ સંક્રમિત છોડમાંથી ફેલાય છે અને મોટાભાગે લીલાશ ભરેલા પાનના જંતુઓ દ્વારા ફેલાય છે. ટુન્ગ્રોનું નિયંત્રણ કરવા માટે રોગપ્રતિરોધક ચોખાની જાતો વાપરો અને સંક્રમિત છોડ નાશ કરો. જંતુ નિયંત્રણ માટે જંતુનાશકોનો ઉપયોગ કરો જેથી વાયરસનું સંક્રમણ ઘટે. તણખડાઓ દૂર કરવા જેવી યોગ્ય ખેતર વ્યવસ્થાપન પદ્ધતિઓ જાળવો, જે જંતુઓ માટે વૈકલ્પિક યજમાન બની શકે છે. સંક્રમિત છોડ તરત જ દૂર કરો અને નાશ કરો જેથી રોગનો પ્રસાર મર્યાદિત થાય. ગેર-મકાનદારો પાક સાથે પાક ફેરપાળું કરવાની ભલામણ કરવામાં આવે છે, જે રોગની પુનરાવૃત્તિ ઘટાડે છે. ટુન્ગ્રો સાથેના ભૌગોલિક વિસ્તારોથી દૂર રહેવું મહત્ત્વનું છે.
ur: چاول میں ٹنگرو ایک وائرس کی وجہ سے ہوتا ہے جو زیادہ تر سبز پتنگے کے کیڑوں کے ذریعے پھیلتا ہے۔ ٹنگرو کو کنٹرول کرنے کے لیے مزاحم چاول کی اقسام کا استعمال کریں اور متاثرہ پودوں کو تباہ کریں۔ وائرس کی منتقلی کو کم کرنے کے لیے کیڑے مار ادویات لگائیں۔ مناسب کھیت کے انتظام کے طریقوں کو یقینی بنائیں، جیسے جڑی بوٹیاں ہٹانا، جو کیڑوں کے لیے متبادل میزبان کے طور پر کام کر سکتی ہیں۔ متاثرہ پودوں کو فوری طور پر ہٹا دیں اور تباہ کریں تاکہ بیماری کے پھیلاؤ کو محدود کیا جا سکے۔ غیر میزبان فصلوں کے ساتھ فصل کی گردش کی سفارش کی جاتی ہے تاکہ بیماری کی دوبارہ موجودگی کو کم کیا جا سکے۔ ٹنگرو سے متاثرہ علاقوں میں چاول لگانے سے گریز کریں۔
