Repository: VanshMomaya7/redact_app_final
Catalog: lib/l10n/app_*.arb
Languages: gu, ur

# pomegranate_alternaria_preventive
source: Ensure proper spacing between plants for good air circulation Apply fungicides like Mancozeb or Copper-based products. Prune affected areas and remove fallen leaves. Practice crop rotation to reduce disease spread. Maintain optimal watering practices to avoid excess moisture.
gu: પાકોના વચ્ચે યોગ્ય અંતર રાખો જેથી સારું હવા પ્રસારણ થાય ફંગસચિપ (Mancozeb) અથવા તાંબાના આધારિત ઉત્પાદનોનો ઉપયોગ કરો પ્રભાવિત વિસ્તારોની છટણી કરો અને પાંદડાઓને દૂર કરો પાતી દાવલી માટે પાક પરિચયનો અભ્યાસ કરો આગળના ઓછા આચરની સાથે પાને પધ્ધતિ જાળવો
ur: پودوں کے درمیان مناسب فاصلہ رکھیں تاکہ ہوا کی گردش اچھی ہو مینگوزیب یا کاپر پر مبنی مصنوعات جیسے فنگسائیڈز لگائیں متاثرہ حصوں کو کاٹ کر گرا ہوا پتے ہٹا دیں مٹی کی افزائش کی کمی کو کم کرنے کے لیے فصلوں کا تبادلہ کریں زیادہ نمی سے بچنے کے لیے پانی دینے کے طریقے کو بہتر بنائیں

# pomegranate_anthracnose
source: Anthracnose
gu: એન્થ્રાક્નોસ
ur: آنٹھرکنووس

# pomegranate_anthracnose_preventive
source: Use fungicides like Copper-based products. Prune affected areas and remove fallen leaves. Practice crop rotation.
gu: તાંબાના આધારિત ફંગસચિપનો ઉપયોગ કરો પ્રભાવિત વિસ્તારોની છટણી કરો અને પાંદડાઓને દૂર કરો પાક પરિચયનો અભ્યાસ કરો
ur: کاپر پر مبنی مصنوعات استعمال کریں متاثرہ حصوں کو کاٹ کر گرا ہوا پتے ہٹا دیں فصلوں کا تبادلہ کریں

# pomegranate_cercospora
source: Cercospora
gu: સેર્કોસપોરા
ur: سیکروسپورا

# pomegranate_cercospora_preventive
source: Apply fungicides like Mancozeb. Practice crop rotation. Remove and destroy infected plant material.
gu: મંકોઝેબ જેવા ફંગસચિપનો ઉપયોગ કરો પાક પરિચયનો અભ્યાસ કરો પ્રભાવિત પાકને દૂર કરો અને નષ્ટ કરો
ur: فنگسائیڈز استعمال کریں، مینگوزیب فصلوں کا تبادلہ کریں متاثرہ پودوں کو نکال دیں

# pomegranate_bacterial_blight
source: Bacterial blight
gu: બેક્ટેરિયલ બ્લાઇટ
ur: بیکٹیریل بلائٹ

# pomegranate_bacterial_blight_preventive
source: Use resistant varieties. Practice proper irrigation. Remove infected plants.
gu: પ્રતિરોધક જાતોનો ઉપયોગ કરો યોગ્ય સિંચાઈ પદ્ધતિઓનો ઉપયોગ કરો પ્રભાવિત પાકને દૂર કરો
ur: مقاوم اقسام استعمال کریں اوپر سے آبپاشی سے بچیں متاثرہ پودوں کو نکال دیں

# pomegranate_healthy
source: Healthy
gu: સ્વસ્થ
ur: صحت مند

# pomegranate_healthy_preventive
source: Ensure optimal water and nutrient management. Regular pest monitoring. Practice crop rotation.
gu: યોગ્ય પાણી અને પોષક તત્વોની વ્યવસ્થાપન કરો નિયમિત કીટક અને રોગોની તપાસ કરો પાક પરિચયનો અભ્યાસ કરો
ur: صحیح پانی اور غذائیت کی انتظامی حکمت عملی کو یقینی بنائیں پests یا بیماریوں کی باقاعدہ جانچ کریں فصلوں کا تبادلہ کریں

# maize_cercospora_leaf_spot
source: Cercospora Leaf Spot gray leaf
gu: સેર્કોસપોરા પાંદડાના ડોગો
ur: سیکروسپورا پتے کا دھبہ گرے پتے

# maize_cercospora_leaf_spot_preventive
source: Use fungicides like Mancozeb. Practice crop rotation. Remove and destroy infected plant material.
gu: મંકોઝેબ જેવા ફંગસચિપનો ઉપયોગ કરો પાક પરિચયનો અભ્યાસ કરો પ્રભાવિત પાકને દૂર કરો
ur: فنگسائیڈز استعمال کریں، مینگوزیب فصلوں کا تبادلہ کریں متاثرہ پودوں کو نکال دیں

# maize_common_rust
source: Common Rust
gu: સામાન્ય રસ્ટ
ur: کامن رسٹ

# maize_common_rust_preventive
source: Apply fungicides like Chlorothalonil. Practice crop rotation. Remove and destroy infected plant material.
gu: ક્લોરોથેલોનિલ જેવા ફંગસચિપનો ઉપયોગ કરો પાક પરિચયનો અભ્યાસ કરો પ્રભાવિત પાકને દૂર કરો
ur: فنگسائیڈز استعمال کریں، کلو روتھالونل فصلوں کا تبادلہ کریں متاثرہ پودوں کو نکال دیں

# maize_healthy
source: Healthy
gu: સ્વસ્થ
ur: صحت مند

# maize_healthy_preventive
source: Ensure optimal water and nutrient management. Regular pest monitoring. Practice crop rotation.
gu: યોગ્ય પાણી અને પોષણ વ્યવસ્થાપન કરો નિયમિત કીટક અને રોગોની તપાસ કરો પાક પરિચયનો અભ્યાસ કરો
ur: صحیح پانی اور غذائیت کی انتظامی حکمت عملی کو یقینی بنائیں پests یا بیماریوں کی باقاعدہ جانچ کریں فصلوں کا تبادلہ کریں

# maize_northern_leaf_blight
source: Northern Leaf Blight
gu: ઉત્તરી પાંદડાની બ્લાઇટ
ur: ناردرن لیف بلیٹ

# maize_northern_leaf_blight_preventive
source: Apply fungicides like Propiconazole. Practice field sanitation. Remove infected plant material.
gu: પ્રોપિકોનાઝોલ જેવા ફંગસચિપનો ઉપયોગ કરો ખેતરો શુદ્ધ રાખો પ્રભાવિત પાકને દૂર કરો
ur: فنگسائیڈز استعمال کریں، پروپیکونازول فیلڈ کی صفائی کریں متاثرہ پودوں کو نکال دیں

# yojna_no_1_name
source: Pradhan Mantri Kisan Samman Nidhi (PM-KISAN)
gu: પ્રધાનમંત્રી કિસાન સન્માન નિધિ
ur: پردھان منتری کسان سمان ندھی

# yojna_no_1_desc
source: Provides income support to small and marginal farmers by transferring Rs. 6,000 annually directly into their bank accounts in three installments of Rs. 2,000 each. This scheme helps farmers manage agricultural inputs, household expenses, and unforeseen needs. The direct benefit transfer mechanism ensures transparency and efficiency, eliminating middlemen and delays. It provides much-needed financial relief to farmers, enabling them to sustain their livelihoods and invest in better agricultural practices.
gu: નાના અને લઘુધારક ખેડુતોને આર્થિક સહાય પૂરી પાડતી યોજના. આ યોજના અંતર્ગત, દર વર્ષે ત્રણ હપ્તામાં ખેડુતોના બેંક ખાતામાં સીધી રીતે ₹6,000 ટ્રાન્સફર થાય છે. આ યોજના ખેડુતોને કૃષિ ઇનપુટ્સ, ઘરખર્ચ અને અનિચ્છનીય જરૂરિયાતોને મેનેજ કરવામાં મદદ કરે છે. સીધા લાભ ટ્રાન્સફર સિસ્ટમ પારદર્શકતા અને કાર્યક્ષમતા સુનિશ્ચિત કરે છે.
ur: چھوٹے اور معمولی کسانوں کو مالی امداد فراہم کرنے والی اسکیم۔ اس اسکیم کے تحت، کسانوں کے بینک کھاتوں میں سالانہ ₹6,000 تین قسطوں میں براہ راست منتقل کیے جاتے ہیں۔ یہ اسکیم کسانوں کی زرعی ضروریات، گھریلو اخراجات اور غیر متوقع ضروریات کو پورا کرنے میں مدد فراہم کرتی ہے۔ براہ راست فائدہ منتقلی کا نظام شفافیت اور کارکردگی کو یقینی بناتا ہے۔

# yojna_no_2_name
source: Pradhan Mantri Fasal Bima Yojana (PMFBY)
gu: પ્રધાનમંત્રી પાક વિમા યોજના
ur: پردھان منتری فصل بیمہ یوجنا

# yojna_no_2_desc
source: Offers comprehensive insurance coverage to protect crops against natural calamities such as floods, droughts, pests, and diseases. Farmers pay a nominal premium, and the government subsidizes the rest, reducing the financial burden. This scheme ensures stability for farmers in the face of unpredictable weather and crop failures. Timely claim settlements allow farmers to recover losses and reinvest in their fields. It promotes risk management and encourages adoption of advanced farming techniques.
gu: કૃષિ પાકોને પુર, સુકા, જીવાતો અને રોગો જેવી કુદરતી આફતો સામે રક્ષિત કરવા માટે વ્યાપક વીમા કવચ પૂરુ પાડે છે. ખેડુતો ન્યુનતમ પ્રીમિયમ ચૂકવે છે, અને બાકી રકમ સરકાર દ્વારા સહાયભર્યા રૂપે આપવામાં આવે છે. આ યોજના ખેડૂતોને અણધારી આબોહવા અને પાક નુકસાન સામે સ્થિરતા પૂરી પાડે છે.
ur: قدرتی آفات جیسے سیلاب، خشک سالی، کیڑوں اور بیماریوں سے فصلوں کی حفاظت کے لیے جامع بیمہ فراہم کرتی ہے۔ کسان معمولی پریمیم ادا کرتے ہیں، اور باقی رقم حکومت فراہم کرتی ہے۔ یہ اسکیم کسانوں کو فصل کی ناکامی کے دوران مالی تحفظ فراہم کرتی ہے۔

# yojna_no_3_name
source: Soil Health Card Scheme
gu: મિટ્ટી આરોગ્ય કાર્ડ યોજના
ur: مٹی صحت کارڈ اسکیم

# yojna_no_3_desc
source: Provides farmers with a soil health card that details the nutrient status and fertility of their land. The scheme aims to educate farmers about the appropriate use of fertilizers and nutrients to improve productivity. It promotes balanced nutrient management, reducing the overuse of chemicals and maintaining soil health. By understanding their soil’s specific needs, farmers can lower input costs and achieve better yields. This initiative ensures sustainable farming and long-term agricultural benefits.
gu: ખેડુતોને તેમની જમીનના પોષકતત્વો અને વળવત્તાનું જ્ઞાન પૂરું પાડે છે. આ યોજના ખાતરોના યોગ્ય ઉપયોગ માટે માર્ગદર્શન પૂરી પાડે છે, જેથી ઉત્પાદનશક્તિ સુધરે છે અને રાસાયણિક ખાતરનો વધુ પડતો ઉપયોગ ટળે છે.
ur: کسانوں کو ان کی زمین کی غذائیت کی کیفیت اور زرخیزی کے بارے میں تفصیلات فراہم کرتی ہے۔ یہ اسکیم کھادوں کے مناسب استعمال کو فروغ دیتی ہے، جس سے پیداواریت میں اضافہ ہوتا ہے اور مٹی کی صحت برقرار رہتی ہے۔

# yojna_no_4_name
source: Kisan Credit Card (KCC)
gu: કિસાન ક્રેડિટ કાર્ડ
ur: کسان کریڈٹ کارڈ

# yojna_no_4_desc
source: The Kisan Credit Card provides farmers with easy and affordable access to credit for agricultural needs such as seeds, fertilizers, equipment, and irrigation. With low-interest rates and flexible repayment terms, it minimizes financial stress for farmers. The scheme also covers allied agricultural activities and post-harvest expenses. It empowers farmers to focus on increasing productivity rather than worrying about funding their operations, ensuring financial inclusion and security for millions of farming families.
gu: ખેડુતોને બીજ, ખાતર, સાધનો અને સિંચાઈ માટે સસ્તું અને સરળ લોન ઉપલબ્ધ કરાવે છે. નીચા વ્યાજ દર અને લવચીક પરતફેર શરતો સાથે, આ યોજના ખેડૂતો પર આર્થિક તણાવ ઘટાડે છે.
ur: کسانوں کو بیج، کھاد، آلات اور آبپاشی کے لیے کم سود کے ساتھ آسان قرض فراہم کرتا ہے۔ یہ اسکیم کسانوں کے مالی دباؤ کو کم کرتی ہے اور انہیں زرعی پیداوار پر توجہ مرکوز کرنے میں مدد دیتی ہے۔

# yojna_no_5_name
source: Pradhan Mantri Krishi Sinchai Yojana (PMKSY)
gu: પ્રધાનમંત્રી કૃષિ સિંચાઈ યોજના
ur: پردھان منتری کرشی سنچائی یوجنا

# yojna_no_5_desc
source: This scheme aims to improve irrigation and water use efficiency. It promotes initiatives like micro-irrigation, rainwater harvesting, and watershed management to ensure water availability for every farm. By reducing dependency on rainfall, it enables farmers to cultivate more land and increase crop yields. The scheme encourages sustainable water practices and conservation, helping farmers manage resources effectively. PMKSY ensures that irrigation reaches even the most remote areas, improving productivity and livelihoods.
gu: સિંચાઈ ક્ષમતા સુધારવા અને દરેક ખેતરમાં પાણી પહોંચાડવા માટે મદદરૂપ થાય છે. આ યોજના પાણીના સંવર્ધન પર ભાર મૂકીને વધુ જમીન પર ખેતી લાયક બનાવે છે.
ur: آبپاشی کی صلاحیت کو بہتر بنانے اور ہر کھیت تک پانی پہنچانے کے لیے مدد فراہم کرتی ہے۔ یہ اسکیم پانی کے تحفظ کو فروغ دیتی ہے اور زیادہ زمین کو کاشت کے قابل بناتی ہے۔

# yojna_no_6_name
source: Rashtriya Krishi Vikas Yojana (RKVY)
gu: રાષ્ટ્રીય કૃષિ વિકાસ યોજના
ur: راشٹریہ کرشی وکاس یوجنا

# yojna_no_6_desc
source: Supports state-specific agricultural projects to improve productivity and address local challenges. The scheme funds infrastructure development, modern technology adoption, and training programs to empower farmers. It encourages diversification into high-value crops, horticulture, and allied activities like fisheries and dairying. By focusing on state priorities, the scheme ensures efficient utilization of resources and boosts farmers' incomes. It promotes innovation and infrastructure development, helping farmers achieve higher returns and sustainable growth.
gu: રાજ્ય-વિશિષ્ટ પ્રોજેક્ટ માટે ભંડોળ પૂરૂ પાડે છે, જે સ્થાનિક પડકારોનું નિરાકરણ લાવે છે અને ઉત્પાદકતા વધારવા માટે સહાય કરે છે.
ur: ریاستی مخصوص منصوبوں کے لیے فنڈ فراہم کرتی ہے جو مقامی مسائل کو حل کرتے ہیں اور پیداوار میں اضافہ کرتے ہیں۔ جدید ٹیکنالوجی اور تربیتی پروگراموں کو فروغ دیتی ہے۔

# yojna_no_7_name
source: National Agriculture Market (eNAM)
gu: રાષ્ટ્રીય કૃષિ બજાર
ur: نیشنل ایگریکلچر مارکیٹ

# yojna_no_7_desc
source: A digital trading platform that connects farmers to buyers across the country, enabling better price discovery and reducing reliance on middlemen. Farmers can sell their produce in distant markets without additional costs. eNAM integrates local mandis, creating a unified national market for agricultural produce. The platform offers transparency, fair pricing, and convenience, helping farmers maximize profits. It also supports quality grading and storage facilities, ensuring a seamless and efficient trade process.
gu: ડિજિટલ પ્લેટફોર્મ છે, જે ખેડુતોને સમગ્ર દેશના ખરીદદારો સાથે જોડે છે. આ યોજના ખેડૂતોને ઊંચી કિંમત પર પાક વેચવા માટે મદદ કરે છે અને મધ્યસ્થીઓને દૂર કરે છે.
ur: ایک ڈیجیٹل تجارتی پلیٹ فارم ہے جو کسانوں کو ملک بھر کے خریداروں سے جوڑتا ہے۔ یہ اسکیم کسانوں کو اچھی قیمت حاصل کرنے اور مڈل مین کو ختم کرنے میں مدد دیتی ہے۔

# yojna_no_8_name
source: Paramparagat Krishi Vikas Yojana (PKVY)
gu: પરંપરાગત કૃષિ વિકાસ યોજના
ur: پرمپرگت کرشی وکاس یوجنا

# yojna_no_8_desc
source: Promotes organic farming by providing financial support and training to farmers. The scheme encourages the use of bio-fertilizers, compost, and eco-friendly farming practices. It helps farmers obtain organic certification, allowing them to access premium markets and earn higher profits. By reducing dependency on chemical inputs, it ensures healthier produce, lowers production costs, and improves soil health. PKVY supports sustainable agricultural practices, benefiting both farmers and the environment.
gu: જૈવિક ખેતી માટે આર્થિક સહાય અને તાલીમ પૂરી પાડે છે. આ યોજના બાયોફર્ટિલાઈઝર્સ અને પર્યાવરણ મૈત્રીપૂર્ણ કૃષિ પદ્ધતિઓ પ્રોત્સાહિત કરે છે.
ur: نامیاتی کھیتی باڑی کے لیے مالی امداد اور تربیت فراہم کرتی ہے۔ یہ اسکیم بائیو فرٹیلائزرز اور ماحول دوست زرعی طریقوں کو فروغ دیتی ہے۔

# yojna_no_9_name
source: Interest Subvention Scheme for Farmers
gu: ખેડુતો માટે વ્યાજ સહાય યોજના
ur: کسانوں کے لیے سود سبسڈی اسکیم

# yojna_no_9_desc
source: Provides short-term agricultural loans at subsidized interest rates, making credit more affordable for farmers. Those who repay their loans on time receive additional rebates, further reducing borrowing costs. The scheme ensures that farmers have timely access to funds for seeds, fertilizers, equipment, and other needs. By minimizing financial stress, it supports farmers in managing their expenses and increasing productivity. The scheme plays a crucial role in stabilizing farmers’ income and promoting growth.
gu: ખેડુતોને ન્યુનતમ વ્યાજ દરે ટૂંકા ગાળાની કૃષિ લોન ઉપલબ્ધ કરાવે છે. સમયસર લોન પરત કરવા પર વિશેષ છૂટ આપવામાં આવે છે.
ur: کسانوں کو کم سود پر قلیل مدتی زرعی قرض فراہم کرتی ہے۔ وقت پر قرض کی واپسی پر اضافی رعایت دی جاتی ہے۔

# yojna_no_10_name
source: Fertilizer Subsidy Scheme
gu: ખાતર સબસિડી યોજના
ur: کھاد سبسڈی اسکیم

# yojna_no_10_desc
source: Ensures that fertilizers are available to farmers at subsidized rates, reducing input costs and promoting balanced nutrient use. The scheme encourages the timely application of fertilizers to improve soil health and crop yields. By lowering expenses, it helps farmers achieve higher profitability while maintaining sustainability. The subsidy system prevents overuse of chemical inputs and ensures the availability of essential nutrients for healthy crop growth, supporting long-term agricultural success.
gu: ખેડુતોને સબસિડીવાળા દરે ખાતરો ઉપલબ્ધ કરાવે છે, જે ખર્ચ ઘટાડે છે. ખાતરોના યોગ્ય ઉપયોગથી પાક ઉત્પાદનશક્તિ સુધારવામાં મદદરૂપ થાય છે.
ur: کسانوں کو سبسڈی پر کھاد فراہم کرتی ہے، جس سے لاگت کم ہوتی ہے۔ مناسب کھاد کے استعمال سے فصل کی پیداوار میں اضافہ ہوتا ہے۔

# yojna_no_11_name
source: National Food Security Mission (NFSM)
gu: રાષ્ટ્રીય અન્ન સુરક્ષા મિશન
ur: قومی غذائی تحفظ مشن

# yojna_no_11_desc
source: Focuses on increasing the production of rice, wheat, pulses, and coarse cereals by providing quality inputs, financial support, and training. The scheme promotes efficient farming techniques, mechanization, and water management. By improving productivity and reducing production costs, it ensures food security for the nation. Farmers benefit from better yields and steady income. The mission also encourages crop diversification and resilience, addressing the challenges of climate change and market demands.
gu: ચોખા, ઘઉં અને દાળના ઉત્પાદનને વધારવા માટે પોષણશક્તિ અને ટેકનિકલ મદદ પૂરી પાડે છે.
ur: چاول، گندم اور دالوں کی پیداوار میں اضافہ کرنے کے لیے مالی اور تکنیکی مدد فراہم کرتی ہے۔

# yojna_no_12_name
source: Gramin Bhandaran Yojana
gu: ગ્રામીણ ગોડાઉન યોજના
ur: دیہی گودام اسکیم

# yojna_no_12_desc
source: Supports farmers in constructing rural godowns to store their produce safely. Proper storage facilities reduce post-harvest losses and enable farmers to sell their crops when market prices are favorable. The scheme provides financial assistance and technical support for infrastructure development. By improving storage capacity, it enhances the agricultural value chain, increases farmers’ profitability, and ensures the availability of quality produce in the market throughout the year.
gu: ખેડુતોને તેમની પાક સુરક્ષિત રીતે સંગ્રહ કરવા માટે ગ્રામીણ ગોડાઉન બનાવવા માટે સહાય કરે છે. સારી સંગ્રહ ક્ષમતાથી ઉત્પાદન નાશ ટાળવામાં સહાય થાય છે.
ur: کسانوں کو ان کی پیداوار کو محفوظ طریقے سے ذخیرہ کرنے کے لیے دیہی گوداموں کی تعمیر میں مدد فراہم کرتی ہے۔

# yojna_no_13_name
source: Pradhan Mantri Kisan MaanDhan Yojana (PM-KMY)
gu: પ્રધાનમંત્રી કિસાન માનધન યોજના
ur: پردھان منتری کسان ماندھن یوجنا

# yojna_no_13_desc
source: Provides a monthly pension of Rs. 3,000 to small and marginal farmers after the age of 60. Farmers contribute a nominal amount during their working years, matched by the government. The scheme ensures financial security in old age, allowing farmers to live a dignified life without financial worries. By addressing post-retirement needs, it brings peace of mind to farmers who have dedicated their lives to feeding the nation.
gu: 60 વર્ષ પછી ખેડુતોને દર મહિને ₹3,000 ની પેન્શન પૂરી પાડે છે. આ યોજના વૃદ્ધાવસ્થામાં આર્થિક સુરક્ષા સુનિશ્ચિત કરે છે.
ur: 60 سال کی عمر کے بعد کسانوں کو ماہانہ ₹3,000 پینشن فراہم کرتی ہے۔ یہ اسکیم بڑھاپے میں مالی تحفظ کو یقینی بناتی ہے۔

# yojna_no_14_name
source: Digital Agriculture Mission
gu: ડિજિટલ કૃષિ મિશન
ur: ڈیجیٹل ایگریکلچر مشن

# yojna_no_14_desc
source: Uses technology to improve farming practices. Tools like weather updates, geospatial analytics, and crop recommendations help farmers make better decisions. It streamlines farming processes, increases efficiency, and reduces risks. The mission empowers farmers with modern technology, ensuring better productivity and profitability.
gu: તકનિકનો ઉપયોગ કરીને ખેતીની પદ્ધતિઓ સુધારે છે. આ યોજના ખેડૂતોને હવામાન અપડેટ અને ખેતી માટે મદદરૂપ થાય છે.
ur: تکنیکی مدد کے ذریعے زرعی طریقوں کو بہتر بناتی ہے۔ یہ اسکیم کسانوں کو موسم کی تازہ کاری اور زرعی مشورے فراہم کرتی ہے۔

# yojna_no_15_name
source: Crop Science for Food and Nutritional Security
gu: ફસલ વિજ્ઞાન અને પોષણ સુરક્ષા
ur: فصل سائنس اور غذائی تحفظ

# yojna_no_15_desc
source: Focuses on developing resilient crops that can withstand adverse conditions like droughts and floods. The scheme promotes research, advanced agricultural techniques, and access to improved seeds. By ensuring stable yields, it enhances food security and supports farmers in managing environmental challenges.
gu: અડચણ ભરી પરિસ્થિતિઓમાં પેદા થનારી પાંદડાઓ માટે નવીનતામય ફલસલ વિજ્ઞાન પર ધ્યાન કેન્દ્રિત કરે છે.
ur: مشکل حالات میں برداشت کرنے والی فصلوں کے لیے تحقیق کو فروغ دیتی ہے۔

# yojna_no_16_name
source: Sustainable Development of Horticulture
gu: બાગાયતી વિકાસ યોજના
ur: باغبانی کی پائیدار ترقی اسکیم

# yojna_no_16_desc
source: Encourages farmers to grow high-value crops like fruits, vegetables, and flowers. The scheme provides financial and technical support to adopt modern cultivation methods, improving yields and profitability. It diversifies income sources for farmers, ensuring better economic stability.
gu: ફળો, શાકભાજી અને અન્ય બાગાયતી પાકની ખેતી માટે મદદરૂપ થાય છે.
ur: پھلوں، سبزیوں اور دیگر باغبانی کی فصلوں کے لیے مدد فراہم کرتی ہے۔

# yojna_no_17_name
source: Formation and Promotion of 10,000 Farmer Producer Organizations (FPOs)
gu: 10,000 ખેડૂત ઉત્પાદક સંગઠન
ur: 10,000 کسان پروڈیوسر آرگنائزیشنز کو فروغ دینے کی اسکیم

# yojna_no_17_desc
source: Encourages farmers to form groups for collective marketing, bargaining, and resource sharing. FPOs provide training, financial assistance, and market access, improving farmers’ incomes. The scheme strengthens farmers' negotiating power in agricultural markets, ensuring better profitability.
gu: ખેડુતોને ગૃપ બનાવી તેમના ઉત્પાદનના શેર્સ વેચવા માટે પ્રોત્સાહન આપે છે.
ur: کسانوں کو اپنی پیداوار کو مشترکہ طور پر مارکیٹ میں فروخت کرنے کے لیے گروپ بنانے کی ترغیب دیتی ہے۔

# yojna_no_18_name
source: Agriculture Infrastructure Fund (AIF)
gu: કૃષિ ઢાંચેતી ભંડોળ
ur: ایگریکلچر انفراسٹرکچر فنڈ

# yojna_no_18_desc
source: Provides loans to farmers for building post-harvest infrastructure like cold storage and warehouses. These facilities reduce wastage and allow farmers to store their produce until market prices improve. The scheme ensures better profitability and strengthens the agricultural value chain.
gu: ગોડાઉન, કોલ્ડ સ્ટોરેજ જેવા ભંડાર માટે સહાય કરે છે.
ur: پوسٹ ہارویسٹ انفراسٹرکچر جیسے گوداموں اور کولڈ اسٹوریج کے لیے مالی امداد فراہم کرتی ہے۔

# yojna_no_19_name
source: Market Intervention Scheme and Price Support Scheme (MIS-PSS)
gu: બજાર હસ્તક્ષેપ યોજના અને કિંમત આધાર યોજના
ur: مارکیٹ انٹروینشن اسکیم اور قیمت سپورٹ اسکیم

# yojna_no_19_desc
source: Protects farmers from losses during periods of oversupply by ensuring fair prices for their crops. The scheme stabilizes market rates and prevents distress sales, providing a safety net for farmers and ensuring steady income.
gu: ખેડુતો માટે પાકની યોગ્ય કિંમતો સુનિશ્ચિત કરવા મદદરૂપ થાય છે.
ur: فصلوں کے لیے مناسب قیمتیں یقینی بناتی ہے اور کسانوں کے نقصان کو کم کرتی ہے۔

# page_3
source: Recommender
gu: ભલામણ કરનાર
ur: سفارش کنندہ

# enter_farm_details
source: Enter your farm details for us to help recommend some crops for the next season:
gu: આગામી સીઝનમાં પાક ભલામણ માટે તમારા ફાર્મની વિગતો દાખલ કરો:
ur: اپنے فارم کی تفصیلات درج کریں تاکہ ہم اگلے سیزن کے لیے کچھ فصلوں کی سفارش کر سکیں:

# n_content
source: Nitrogen (N) Content
gu: નાઇટ્રોજન (N) સામગ્રી
ur: نائٹروجن (N) مواد

# p_content
source: Phosphorus (P) Content
gu: ફોસ્ફરસ (P) સામગ્રી
ur: فاسفورس (P) مواد

# k_content
source: Potassium (K) Conetnt
gu: પોટેશિયમ (K) સામગ્રી
ur: پوٹاشیم (K) مواد

# temp
source: Temperature (°C)
gu: તાપમાન (°C)
ur: درجہ حرارت (°C)

source: Humidity (%)
gu: ભેજ (%)
ur: نمی (%)

source: Soil pH
gu: મૃદા પીએચ
ur: مٹی کا پی ایچ

# rain
source: Rainfall (mm)
gu: વરસાદ (મિમિ)
ur: بارش (ملی میٹر)

# get_recommend
source: Get Recommendations
gu: ભલામણ મેળવો
ur: سفارشات حاصل کریں

# page_4
source: Voice Assistant
gu: વૉઇસ સહાયક
ur: وائس اسسٹنٹ

# enter_a_text
source: Type a message...
gu: એક સંદેશ ટાઇપ કરો...
ur: ایک پیغام لکھیں...

# recommended
source: Recommended Crop
gu: ભલામણ કરેલો પાક
ur: سفارش کردہ فصل

# page_5
source: Preventive Measures
gu: પ્રતિરોધક પગલાં
ur: احتیاطی تدابیر

# selection
source: Select a crop
gu: એક પાક પસંદ કરો
ur: ایک فصل منتخب کریں

# deafult_page_5
source: Please select a crop to view diseases.
gu: રોગો જોવા માટે કૃપા કરીને એક પાક પસંદ કરો.
ur: براہ کرم بیماریوں کو دیکھنے کے لئے ایک فصل منتخب کریں۔

# page_6
source: Government Schemas
gu: સરકારી યોજના
ur: حکومتی اسکیمیں
