Repository: VanshMomaya7/redact_app_final
Catalog: lib/l10n/app_*.arb
Languages: gu, ur

# language
source: English
gu: ગુજરાતી
ur: اردو

# login_heading
source: Sign in to your account
gu: તમારા એકાઉન્ટમાં સાઇન ઇન કરો
ur: اپنے اکاؤنٹ میں سائن ان کریں۔

source: Username
gu: વપરાશકર્તા નામ
ur: صارف نام

source: Password
gu: પાસવર્ડ
ur: پاس ورڈ

source: SIGN IN
gu: સાઇન ઇન કરો
ur: سائن ان کریں۔

# signup_txt
source: Don't have an account?
gu: ખાતું નથી?
ur: اکاؤنٹ نہیں ہے؟

source: SIGN UP
gu: સાઇન અપ કરો
ur: سائن اپ کریں۔

# signup_heading
source: Create your account
gu: તમારું એકાઉન્ટ બનાવો
ur: اپنا اکاؤنٹ بنائیں

source: Name
gu: નામ
ur: نام

# contact
source: Contact No.
gu: સંપર્ક નં.
ur: رابطہ نمبر

# confirm
source: Confirm Password
gu: પાસવર્ડની પુષ્ટિ કરો
ur: پاس ورڈ کی تصدیق کریں۔

# signin_txt
source: Already have an account?
gu: પહેલેથી એકાઉન્ટ છે?
ur: پہلے سے ہی اکاؤنٹ ہے؟

# slide1
source: Click a picture or upload an image of your crop to get detailed insights
gu: વિગતવાર આંતરદૃષ્ટિ મેળવવા માટે ચિત્ર પર ક્લિક કરો અથવા તમારા પાકની છબી અપલોડ કરો
ur: تفصیلی بصیرت حاصل کرنے کے لیے تصویر پر کلک کریں یا اپنی فصل کی تصویر اپ لوڈ کریں۔

# slide2
source: Disease identification and its cause
gu: રોગની ઓળખ અને તેનું કારણ
ur: بیماری کی شناخت اور اس کی وجہ

# slide3
source: Preventive measures and suggested medicines
gu: નિવારક પગલાં અને સૂચવેલ દવાઓ
ur: احتیاطی تدابیر اور تجویز کردہ ادویات

# slide4
source: AI chatbot and voice assistant for describing crop symptoms and predicting diseases accurately
gu: પાકના લક્ષણોનું વર્ણન કરવા અને રોગોની ચોક્કસ આગાહી કરવા માટે AI ચેટબોટ અને વૉઇસ સહાયક
ur: فصل کی علامات کو بیان کرنے اور بیماریوں کی درست پیش گوئی کرنے کے لیے AI چیٹ بوٹ اور وائس اسسٹنٹ

# slide5
source: Crop Recommendations
gu: પાકની ભલામણો
ur: فصل کی سفارشات

# slide6
source: Allow us to use your device location
gu: અમને તમારા ઉપકરણ સ્થાનનો ઉપયોગ કરવાની મંજૂરી આપો
ur: ہمیں آپ کے آلے کا مقام استعمال کرنے کی اجازت دیں۔

source: Next
gu: આગળ
ur: اگلا

source: Skip
gu: છોડો
ur: چھوڑیں۔

source: Accept
gu: સ્વીકારો
ur: قبول کریں۔

# welcome_head
source: Welcome to
gu: આપનું સ્વાગત છે
ur: میں خوش آمدید

# shetkari
source: Agriguard
gu: શેતકરી માં
ur: ایگری گارڈ

# descrp
source: Your trusted companion in detecting and managing crop diseases, with real-time predictions, actionable insights, and expert advice to safeguard your fields and maximize yields.
gu: તમારા ખેતરોની રક્ષા કરવા અને ઉપજને મહત્તમ કરવા માટે વાસ્તવિક સમયની આગાહીઓ, પગલાં લેવા યોગ્ય આંતરદૃષ્ટિ અને નિષ્ણાત સલાહ સાથે, એબીડીનું સંચાલન કરતા પાકના રોગોને શોધવામાં તમારો વિશ્વાસપાત્ર સાથી.
ur: آپ کے کھیتوں کی حفاظت اور پیداوار کو زیادہ سے زیادہ کرنے کے لیے حقیقی وقت کی پیشین گوئیوں، قابل عمل بصیرت، اور ماہر مشورے کے ساتھ فصلوں کی بیماریوں کا پتہ لگانے میں آپ کا قابل اعتماد ساتھی۔

# picture
source: Click or Upload a Picture
gu: છબી પર ક્લિક કરો અથવા અપલોડ કરો
ur: کلک کریں یا تصویر اپ لوڈ کریں۔

source: or
gu: અથવા
ur: یا

source: Profile
gu: પ્રોફાઇલ
ur: پروفائل

# edit_pfp
source: Edit Profile
gu: પ્રોફાઇલ સંપાદિત કરો
ur: پروفائل میں ترمیم کریں۔

source: History
gu: ઈતિહાસ
ur: تاریخ

source: Saved
gu: સાચવેલ
ur: محفوظ کیا گیا۔

source: SIGN OUT
gu: સાઇન આઉટ કરો
ur: سائن آؤٹ کریں۔

source: Contact Us
gu: અમારો સંપર્ક કરો
ur: ہم سے رابطہ کریں۔

# icon_desp
source: Icon Description
gu: ચિહ્ન વર્ણન
ur: آئیکن کی تفصیل

# page1
source: Home Page
gu: હોમ પેજ
ur: ہوم پیج

# page2
source: Disease Detection
gu: રોગની તપાસ
ur: بیماری کا پتہ لگانا

# page3
source: Preventive Measures
gu: નિવારક પગલાં
ur: احتیاطی تدابیر

# page4
source: ChatBot
gu: ચેટબોટ
ur: چیٹ بوٹ

# page5
source: Voice Assistance
gu: વૉઇસ સહાય
ur: صوتی معاونت

# page6
source: Recommendations
gu: ભલામણો
ur: سفارشات

# page1_s1
source: About Disease
gu: રોગ વિશે
ur: بیماری کے بارے میں

# page1_s2
source: Causes
gu: રોગના કારણો
ur: اسباب

# page6_s1
source: Suggestive Crops
gu: સૂચક પાક
ur: مشورے والی فصلیں۔

source: Apple
gu: સફરજન
ur: سیب

source: Cotton
gu: કપાસ
ur: روئی

source: Cauliflower
gu: ફુલકોબી
ur: گوبھی

source: Maize
gu: મકાઈ
ur: مکئی

source: Pomegranate
gu: દાડમ
ur: انار

source: Rice
gu: ચોખા
ur: چاول

source: Sugarcane
gu: શેરડી
ur: گنا

source: Soyabean
gu: સોયાબીન
ur: سویا بین

source: Spinach
gu: પાલક
ur: پالک

source: Tomato
gu: ટમેટા
ur: ٹماٹر

source: Apple Scab
gu: સફરજનનો સ્કૅબ
ur: سیب کا اسکاب

# apple_scab_preventive
source: Ensure proper spacing between plants for good air circulation Apply fungicides like Mancozeb or Copper-based products. Prune affected areas and remove fallen leaves. Practice crop rotation to reduce disease spread. Maintain optimal watering practices to avoid excess moisture.
gu: બેાંટોના વચ્ચે યોગ્ય અંતર રાખો જેથી સારું હવા પ્રસારણ થાય ફંગસચિપ (Mancozeb) અથવા તાંબાના આધારિત ઉત્પાદનોનો ઉપયોગ કરો પ્રભાવિત વિસ્તારોની છટણી કરો અને પાંદડાઓને દૂર કરો પાતી દાવલી માટે પાક પરિચયનો અભ્યાસ કરો આગળના ઓછા આચરની સાથે પાને પધ્ધતિ જાળવો
ur: پودوں کے درمیان مناسب فاصلہ رکھیں تاکہ ہوا کی گردش اچھی ہو مینگوزیب یا کاپر پر مبنی مصنوعات جیسے فنگسائیڈز لگائیں متاثرہ حصوں کو کاٹ کر گرا ہوا پتے ہٹا دیں مٹی کی افزائش کی کمی کو کم کرنے کے لیے فصلوں کا تبادلہ کریں زیادہ نمی سے بچنے کے لیے پانی دینے کے طریقے کو بہتر بنائیں

source: Apple Black Rot
gu: સફરજનનો કાળો દુર્ગંધ
ur: سیب کا بلیک روٹ

# apple_black_rot_preventive
source: Ensure proper spacing between plants for good air circulation Apply fungicides like Mancozeb or Copper-based products. Prune affected areas and remove fallen leaves. Practice crop rotation to reduce disease spread. Maintain optimal watering practices to avoid excess moisture.
gu: બેાંટોના વચ્ચે યોગ્ય અંતર રાખો જેથી સારું હવા પ્રસારણ થાય ફંગસચિપ (Mancozeb) અથવા તાંબાના આધારિત ઉત્પાદનોનો ઉપયોગ કરો પ્રભાવિત વિસ્તારોની છટણી કરો અને પાંદડાઓને દૂર કરો પાતી દાવલી માટે પાક પરિચયનો અભ્યાસ કરો આગળના ઓછા આચરની સાથે પાને પધ્ધતિ જાળવો
ur: پودوں کے درمیان مناسب فاصلہ رکھیں تاکہ ہوا کی گردش اچھی ہو مینگوزیب یا کاپر پر مبنی مصنوعات جیسے فنگسائیڈز لگائیں متاثرہ حصوں کو کاٹ کر گرا ہوا پتے ہٹا دیں مٹی کی افزائش کی کمی کو کم کرنے کے لیے فصلوں کا تبادلہ کریں زیادہ نمی سے بچنے کے لیے پانی دینے کے طریقے کو بہتر بنائیں

source: Apple Cedar Apple Rust
gu: સફરજન સીડર એપલ જંગ
ur: سیب کا سیڈر اپل رسٹ

# apple_cedar_apple_rust_preventive
source: Ensure proper spacing between plants for good air circulation Apply fungicides like Mancozeb or Copper-based products. Prune affected areas and remove fallen leaves. Practice crop rotation to reduce disease spread. Maintain optimal watering practices to avoid excess moisture.
gu: બેાંટોના વચ્ચે યોગ્ય અંતર રાખો જેથી સારું હવા પ્રસારણ થાય ફંગસચિપ (Mancozeb) અથવા તાંબાના આધારિત ઉત્પાદનોનો ઉપયોગ કરો પ્રભાવિત વિસ્તારોની છટણી કરો અને પાંદડાઓને દૂર કરો પાતી દાવલી માટે પાક પરિચયનો અભ્યાસ કરો આગળના ઓછા આચરની સાથે પાને પધ્ધતિ જાળવો
ur: پودوں کے درمیان مناسب فاصلہ رکھیں تاکہ ہوا کی گردش اچھی ہو مینگوزیب یا کاپر پر مبنی مصنوعات جیسے فنگسائیڈز لگائیں متاثرہ حصوں کو کاٹ کر گرا ہوا پتے ہٹا دیں مٹی کی افزائش کی کمی کو کم کرنے کے لیے فصلوں کا تبادلہ کریں زیادہ نمی سے بچنے کے لیے پانی دینے کے طریقے کو بہتر بنائیں

source: Apple Healthy
gu: સ્વસ્થ સફરજન
ur: سیب صحت مند

# apple_healthy_preventive
source: Ensure proper plant care, proper watering, and nutrient management. Regularly inspect for pests or diseases. Practice crop rotation.
gu: પાકની યોગ્ય જાળવણી, યોગ્ય પાણી અને પોષક તત્વોની વ્યવસ્થાપન કરો પાંદડાઓ અથવા પાક માટે નિયમિતપણે તપાસ કરો પાક પરિચયનો અભ્યાસ કરો
ur: پودوں کی صحیح دیکھ بھال، پانی اور غذائیت کی مناسب انتظامی حکمت عملی کو یقینی بنائیں پests یا بیماریوں کی باقاعدہ جانچ کریں فصلوں کا تبادلہ کریں

# rice_tungro
source: Tungro
gu: ટંગરો
ur: ٹن گرو

# rice_tungro_preventive
source: Use resistant rice varieties Control vector insects with pesticides. Practice field sanitation. Avoid excessive nitrogen fertilizers.
gu: પ્રતિરોધક ધાનની જાતોનો ઉપયોગ કરો કિટકીઓના નિયંત્રણ માટે કીટનાશકનો ઉપયોગ કરો ખેતરો શુદ્ધ રાખો આવશ્યક નાઇટ્રોજન ખાતરની માત્રામાં નિયંત્રણ રાખો
ur: مقاومتی چاول کی اقسام استعمال کریں مٹی کے کیڑے مکوڑوں کو کنٹرول کریں فیلڈ کی صفائی کریں زیادہ نائٹروجن والے کھادوں سے بچیں

# rice_blast
source: Rice blast is a fungal disease that can be controlled by applying fungicides like Pyricularia or Tricyclazole. These fungicides help manage the disease and prevent its spread to healthy plants. It is important to use resistant rice varieties to minimize the impact of rice blast. Maintaining proper irrigation and field drainage practices is essential, as stagnant water promotes fungal growth. Ensure proper plant spacing to enhance airflow and reduce humidity. Remove and destroy infected plants promptly to prevent further spread. Crop rotation with non-susceptible crops can help reduce the recurrence of rice blast in future seasons.
gu: ચોખામાં બ્લાસ્ટ રોગ ફૂગનાશકોના ઉપયોગ દ્વારા નિયંત્રિત કરી શકાય છે, જેમ કે પાયરિક્યુલારિયા અથવા ટ્રાયસાયક્લાઝોલ. આ ફૂગનાશક રોગના નિયંત્રણમાં મદદ કરે છે અને સ્વસ્થ છોડમાં ફેલાતા અટકાવે છે. ચોખાના રોગપ્રતિરોધક જાતોનો ઉપયોગ કરીને બ્લાસ્ટના પ્રભાવને ઘટાડી શકાય છે. યોગ્ય સિંચાઈ અને ખેતરની ડ્રેનેજ પદ્ધતિઓ જાળવવી જરૂરી છે, કારણ કે સ્થિર પાણી ફૂગના વિકાસને પ્રોત્સાહન આપે છે. હવાની પ્રવાહમાં સુધારો કરવા અને ભેજ ઘટાડવા માટે યોગ્ય છોડના અંતર સુનિશ્ચિત કરો. રોગનો વધુ પ્રસાર અટકાવવા માટે સંક્રમિત છોડને તરત જ દૂર કરો અને નાશ કરો. ગેર-સંવેદનશીલ પાક સાથે પાક ફેરપાળું કરવાથી ચોખાના બ્લાસ્ટની પુનરાવૃત્તિ ઓછું થાય છે.
ur: چاول میں رائس بلاسٹ، ایک فنگل بیماری، کو پائرکولاریا یا ٹرائیسائکلوزول جیسے فنگسائڈز کے استعمال سے کنٹرول کیا جا سکتا ہے۔ یہ فنگسائڈز بیماری کے انتظام اور صحت مند پودوں میں اس کے پھیلاؤ کو روکنے میں مدد کرتے ہیں۔ چاول کی مزاحم اقسام کا استعمال کر کے رائس بلاسٹ کے اثرات کو کم کیا جا سکتا ہے۔ مناسب آبپاشی اور کھیت کی نکاسی کے طریقوں کو برقرار رکھنا ضروری ہے، کیونکہ کھڑا پانی فنگس کی نشوونما کو فروغ دیتا ہے۔ ہوا کے بہاؤ کو بڑھانے اور نمی کو کم کرنے کے لیے مناسب پودوں کے فاصلہ کو یقینی بنائیں۔ بیماری کے مزید پھیلاؤ کو روکنے کے لیے متاثرہ پودوں کو فوراً ہٹا دیں اور ضائع کریں۔ غیر حساس فصلوں کے ساتھ فصل کی گردش رائس بلاسٹ کی دوبارہ موجودگی کو کم کرنے میں مدد کر سکتی ہے۔

# rice_blast_preventive
source: Apply fungicides like Pyricularia or Tricyclazole. Rotate crops with non-host plants. Use resistant rice varieties.
gu: પાયરિક્યુલારિયા અથવા ટ્રાયસાયક્લોઝોલ જેવા ફંગસચિપનો ઉપયોગ કરો પાક પરિચયનો અભ્યાસ કરો પ્રતિરોધક ધાનની જાતોનો ઉપયોગ કરો
ur: فنگسائیڈز لگائیں جیسے پائریکولیریا یا ٹری سائیکلوزول فصلوں کا تبادلہ کریں مقاومتی چاول کی اقسام استعمال کریں

# rice_brownspot
source: Brownspot
gu: બ્રાઉનસ્પોટ
ur: براؤن سپاٹ

# rice_brownspot_preventive
source: Remove infected rice plants. Apply fungicides like Carbendazim. Maintain proper irrigation practices.
gu: પ્રભાવિત ધાનના પાકને દૂર કરો કાર્બેન્ડાઝિમ જેવા ફંગસચિપનો ઉપયોગ કરો યોગ્ય સિંચાઈ પદ્ધતિઓને અનુસરો
ur: متاثرہ چاول کے پودوں کو نکال دیں فنگسائیڈز لگائیں جیسے کاربینڈازیم صحیح آبیاری کی پریکٹس کو اپنائیں

# rice_bacterial_blight
source: Bacterial Blight
gu: બેક્ટેરિયલ બ્લાઇટ
ur: بیکٹیریل بلائٹ

# rice_bacterial_blight_preventive
source: Use resistant varieties. Avoid overhead irrigation. Use clean seeds.
gu: પ્રતિરોધક જાતોનો ઉપયોગ કરો ઉપરથી સિંચાઈથી બચો શુદ્ધ બીજનો ઉપયોગ કરો
ur: مقاومتی اقسام استعمال کریں اوپر سے آبپاشی سے بچیں صاف بیج استعمال کریں

# sugarcane_yellow_rust
source: Yellow Rust
gu: પળેલું રસ્ટ
ur: پیلا رسٹ

# sugarcane_yellow_rust_preventive
source: Apply fungicides like Propiconazole. Practice crop rotation. Remove and destroy infected plant material.
gu: પ્રોપિકોનોઝોલ જેવા ફંગસચિપનો ઉપયોગ કરો પાક પરિચયનો અભ્યાસ કરો પ્રભાવિત પાકને દૂર કરો અને નષ્ટ કરો
ur: فنگسائیڈز لگائیں جیسے پروپیکونازول فصلوں کا تبادلہ کریں متاثرہ پودوں کو ہٹا دیں

# sugarcane_red_rot
source: Red Rot
gu: લાલ સડણ
ur: سرخ روٹ

# sugarcane_red_rot_preventive
source: Use disease-free planting material. Control pest infestation. Apply fungicides like Thiophanate-methyl.
gu: વિરોધક રોપણ સામગ્રીનો ઉપયોગ કરો કિટકીઓની મેડિકલને નિયંત્રણ કરો થાયોફેનેટ-મેથિલ જેવા ફંગસચિપનો ઉપયોગ કરો
ur: بیما تلافی پودوں کا استعمال کریں کیڑوں کے حملے کو کنٹرول کریں فنگسائیڈز لگائیں جیسے تھیوفینیٹ-میتھائل

# sugarcane_red_rust
source: Red Rust
gu: લાલ રસ્ટ
ur: سرخ رسٹ

# sugarcane_red_rust_preventive
source: Control weed growth. Use resistant varieties. Apply fungicides like Copper-based products.
gu: ઘાસના કીટકોથી નિયંત્રણ રાખો પ્રતિરોધક જાતોનો ઉપયોગ કરો તાંબાના આધારિત ફંગસચિપનો ઉપયોગ કરો
ur: گھاسوں کو کنٹرول کریں مقاومتی اقسام کا استعمال کریں کاپر پر مبنی مصنوعات لگائیں

# sugarcane_mosaic
source: Mosaic
gu: મોઝેક
ur: موزیک

# sugarcane_mosaic_preventive
source: Use resistant varieties. Control aphids and other vector pests. Practice crop rotation.
gu: પ્રતિરોધક જાતોનો ઉપયોગ કરો આફીડ અને અન્ય કીટકોથી નિયંત્રણ રાખો પાક પરિચયનો અભ્યાસ કરો
ur: مقاومتی اقسام استعمال کریں افڈس جیسے کیڑے مکوڑوں کو کنٹرول کریں فصلوں کا تبادلہ کریں

# sugarcane_healthy
source: Healthy Sugarcane
gu: સ્વસ્થ ગુલાબ
ur: صحت مند گنے

# sugarcane_healthy_preventive
source: Ensure optimal water and nutrient management. Regular pest monitoring and management. Maintain field sanitation.
gu: યોગ્ય પાણી અને પોષણ વ્યવસ્થાપન કરો નિયમિત કીટક અને રોગોની તપાસ કરો ખેતરો શુદ્ધ રાખો
ur: صحیح پانی اور غذائیت کی انتظامی حکمت عملی کو یقینی بنائیں کیڑوں کی باقاعدہ نگرانی کریں فصلوں کا تبادلہ کریں

# tomato_bacterial_spot
source: Bacterial Spot
gu: બેક્ટેરિયલ સ્પોટ
ur: بیکٹیریل سپاٹ

# tomato_bacterial_spot_preventive
source: Apply copper-based fungicides. Avoid overhead irrigation. Practice crop rotation.
gu: તાંબાના આધારિત ફંગસચિપનો ઉપયોગ કરો ઉપરથી સિંચાઈથી બચો પાક પરિચયનો અભ્યાસ કરો
ur: کاپر پر مبنی فنگسائیڈز لگائیں اوپر سے آبپاشی سے بچیں فصلوں کا تبادلہ کریں

# tomato_early_blight
source: Early Blight
gu: અગાઉ બ્લાઇટ
ur: ایرلی بلیٹ

# tomato_early_blight_preventive
source: Apply fungicides like Chlorothalonil. Remove and destroy infected plant material. Practice crop rotation.
gu: ક્લોરોથેલોનિલ જેવા ફંગસચિપનો ઉપયોગ કરો પ્રભાવિત પાકને દૂર કરો અને નષ્ટ કરો પાક પરિચયનો અભ્યાસ કરો
ur: کلو روتھالونل جیسے فنگسائیڈز لگائیں متاثرہ پودوں کو نکال دیں فصلوں کا تبادلہ کریں

# tomato_late_blight
source: Late Blight
gu: આવ્યું બ્લાઇટ
ur: لیٹ بلیٹ

# tomato_late_blight_preventive
source: Apply fungicides like Metalaxyl. Practice crop rotation. Remove infected plant material.
gu: મેટાલેક્સિલ જેવા ફંગસચિપનો ઉપયોગ કરો પાક પરિચયનો અભ્યાસ કરો પ્રભાવિત પાકને દૂર કરો અને નષ્ટ કરો
ur: میٹل اَسِل جیسے فنگسائیڈز لگائیں فصلوں کا تبادلہ کریں متاثرہ پودوں کو نکال دیں

# tomato_leaf_mold
source: Leaf Mold
gu: પાંદડાનું મોલ્ડ
ur: پتے کی پھپھوندی

# tomato_leaf_mold_preventive
source: Ensure proper spacing between plants. Control humidity levels in greenhouses. Use fungicides like Chlorothalonil.
gu: પાકોના વચ્ચે યોગ્ય અંતર રાખો ગ્રીનહાઉસમાં ઓલાવું નિયંત્રણ કરો ક્લોરોથેલોનિલ જેવા ફંગસચિપનો ઉપયોગ કરો
ur: پودوں کے درمیان مناسب فاصلہ رکھیں گرین ہاؤسز میں نمی کے سطحوں کو کنٹرول کریں فنگسائیڈز لگائیں جیسے کلو روتھالونل

# tomato_septoria_leaf_spot
source: Septoria Leaf Spot
gu: સેપ્ટોરિયા પાંદડાનું બિંદુ
ur: سیپٹوریا پتے کے دھبے

# tomato_septoria_leaf_spot_preventive
source: Use fungicides like Mancozeb. Remove infected plant material. Practice crop rotation.
gu: મંકોઝેબ જેવા ફંગસચિપનો ઉપયોગ કરો પ્રભાવિત પાકને દૂર કરો અને નષ્ટ કરો પાક પરિચયનો અભ્યાસ કરો
ur: فنگسائیڈز لگائیں جیسے مینگوزیب متاثرہ پودوں کو نکال دیں فصلوں کا تبادلہ کریں

# tomato_spider_mites
source: Spider Mites (Two-Spotted Spider Mite)
gu: સ્પાઈડર માઇટ્સ (ટૂ-સ્પોટેડ સ્પાઈડર માઇટ)
ur: ٹارگٹ سپاٹ

# tomato_spider_mites_preventive
source: Use miticides. Increase humidity to deter mites. Regularly monitor and remove infested plants.
gu: માઇટસાઇડનો ઉપયોગ કરો માઇટ્સ અટકાવ માટે ઓલાવું વધારવું પ્રભાવિત પાકને દૂર કરો
ur: فنگسائیڈز لگائیں جیسے پائراکلوسٹرو بن صحیح پانی دینے کے طریقے کو اپنائیں متاثرہ پودوں کو نکال دیں

# tomato_target_spot
source: Target Spot
gu: ટાર્ગેટ સ્પોટ
ur: ٹارگٹ سپاٹ

# tomato_target_spot_preventive
source: Apply fungicides like Pyraclostrobin. Practice proper irrigation techniques. Remove infected plant material.
gu: પાય્રાક્લોસ્ટ્રોબિન જેવા ફંગસચિપનો ઉપયોગ કરો સિંચાઈ પદ્ધતિઓ અનુસરો પ્રભાવિત પાકને દૂર કરો
ur: فنگسائیڈز لگائیں جیسے پائراکلوسٹرو بن فصلوں کا تبادلہ کریں متاثرہ پودوں کو نکال دیں

# tomato_ytlcv
source: Tomato Yellow Leaf Curl Virus (TYLCV)
gu: ટમાટર યેલો લીફ કર્લ વિરુસ (TYLCV)
ur: ٹماٹر ییلو لیف کرل وائرس (TYLCV)

# tomato_ytlcv_preventive
source: Control whitefly populations. Use resistant tomato varieties. Remove infected plants.
gu: વ્હાઇટફ્લાયની સંખ્યા નિયંત્રિત કરો પ્રતિરોધક ટમાટર જાતોનો ઉપયોગ કરો પ્રભાવિત પાકને દૂર કરો
ur: وائٹ فلائی کی آبادی کو کنٹرول کریں مقاوم ٹماٹر اقسام کا استعمال کریں متاثرہ پودوں کو نکال دیں

source: Tomato Healthy
gu: સ્વસ્થ ટમાટર
ur: ٹماٹر صحت مند

# tomato_healthy_preventive
source: Ensure proper watering and fertilization. Regular pest and disease monitoring. Practice crop rotation.
gu: યોગ્ય પાણી અને ઉર્વરક વ્યવસ્થાપન કરો નિયમિત કીટક અને રોગોની તપાસ કરો પાક પરિચયનો અભ્યાસ કરો
ur: صحیح پانی اور غذائیت کی انتظامی حکمت عملی کو یقینی بنائیں کیڑوں کی باقاعدہ نگرانی کریں فصلوں کا تبادلہ کریں

# cotton_bacterial_blight
source: Bacterial Blight
gu: બેક્ટેરિયલ બ્લાઇટ
ur: بیکٹیریل بلائٹ

# cotton_bacterial_blight_preventive
source: Use resistant cotton varieties. Remove infected plant material. Practice crop rotation.
gu: પ્રતિરોધક કાપસ જાતોનો ઉપયોગ કરો પ્રભાવિત પાકને દૂર કરો અને નષ્ટ કરો પાક પરિચયનો અભ્યાસ કરો
ur: مقاوم کاتن اقسام استعمال کریں متاثرہ پودوں کو نکال دیں فصلوں کا تبادلہ کریں

source: Cotton Aphid
gu: કપાસનું આફિડ
ur: کاتن آفیڈ

# cotton_aphid_preventive
source: Use insecticides like Imidacloprid. Control aphid populations with natural predators.
gu: ઇમિડાક્લોપ્રીડ જેવા કીટનાશકોનો ઉપયોગ કરો પ્રાકૃતિક શિકારીઓનો ઉપયોગ કરીને આફિડની સંખ્યા નિયંત્રિત કરો
ur: انسییکٹیسائیڈز استعمال کریں، امیڈاکلوپرائیڈ جیسے آفیڈ کی آبادی کو قدرتی شکاریوں کے ذریعے کنٹرول کریں

source: Cotton Whitefly
gu: કપાસની પાંદડી મચ્છર
ur: کاتن وائٹ فلائی

# cotton_whitefly_preventive
source: Use insecticides like Thiamethoxam. Introduce natural predators like ladybugs.
gu: થાયામેથોક્સમ જેવા કીટનાશકોનો ઉપયોગ કરો પ્રાકૃતિક શિકારીઓ જેવી કે લેડીબગ્સનો ઉપયોગ કરો
ur: انسییکٹیسائیڈز استعمال کریں، تھایامیتھوکسام جیسے قدرتی شکاریوں کو متعارف کرائیں

# cotton_anthracnose
source: Antracnose
gu: એન્થ્રાક્નોસ
ur: آنٹھرکنووس

# cotton_anthracnose_preventive
source: Apply fungicides like Chlorothalonil. Practice field sanitation. Remove and destroy infected plants.
gu: ક્લોરોથેલોનિલ જેવા ફંગસચિપનો ઉપયોગ કરો ખેતરો શુદ્ધ રાખો પ્રભાવિત પાકને દૂર કરો અને નષ્ટ કરો
ur: فنگسائیڈز استعمال کریں، کلو روتھالونل جیسے فیلڈ کی صفائی کریں متاثرہ پودوں کو نکال دیں

# cotton_healthy
source: Healthy Cotton
gu: સ્વસ્થ કપાસ
ur: صحت مند کاتن

# cotton_healthy_preventive
source: Ensure proper water and nutrient management. Regular pest monitoring. Use disease-resistant varieties.
gu: યોગ્ય પાણી અને પોષણનો વ્યવસ્થાપન કરો નિયમિત કીટક તપાસ કરો પ્રતિરોધક જાતોનો ઉપયોગ કરો
ur: صحیح پانی اور غذائیت کی انتظامی حکمت عملی کو یقینی بنائیں کیڑوں کی باقاعدہ نگرانی کریں مقاوم اقسام استعمال کریں

# cotton_red_cotton_bug
source: Red Cotton Bug
gu: લાલ કપાસ બગ
ur: ریڈ کاتن بگ

# cotton_red_cotton_bug_preventive
source: Use insecticides like Malathion. Encourage natural predators.
gu: માલાથિયાન જેવા કીટનાશકોનો ઉપયોગ કરો પ્રાકૃતિક શિકારીઓને પ્રોત્સાહિત કરો
ur: انسییکٹیسائیڈز استعمال کریں، مالیتھایان جیسے قدرتی شکاریوں کو متعارف کرائیں

# cauliflower_downy_mildew
source: Downy Mildew
gu: ડાઉની મીલ્ડ્યૂ
ur: ڈاؤن میلوڈیو

# cauliflower_downy_mildew_preventive
source: Apply fungicides like Metalaxyl. Ensure proper spacing between plants. Remove and destroy infected plant material.
gu: મેટાલેક્સિલ જેવા ફંગસચિપનો ઉપયોગ કરો પાકોના વચ્ચે યોગ્ય અંતર રાખો પ્રભાવિત પાકને દૂર કરો
ur: فنگسائیڈز استعمال کریں، میٹالاکسل پودوں کے درمیان مناسب فاصلہ رکھیں متاثرہ پودوں کو نکال دیں

# cauliflower_bacterial_spot_rot
source: Bacterial spot rot
gu: બેક્ટેરિયલ સ્પોટ રોટ
ur: بیکٹیریل سپاٹ راسٹ

# cauliflower_bacterial_spot_rot_preventive
source: Use bactericides like Copper sulfate. Practice crop rotation. Ensure proper irrigation practices.
gu: કોપર સલ્ફેટ જેવા બેક્ટીરિયાસાઈડનો ઉપયોગ કરો પાક પરિચયનો અભ્યાસ કરો યોગ્ય સિંચાઈ પદ્ધતિઓનો ઉપયોગ કરો
ur: بیکٹیری سائیڈز استعمال کریں، کاپر سلفیٹ جیسے فصلوں کا تبادلہ کریں صحیح آبیاری کی پریکٹس کو اپنائیں

# cauliflower_black_rot
source: Black rot
gu: કાળો સડણ
ur: بلیک روٹ

# cauliflower_black_rot_preventive
source: Apply fungicides like Chlorothalonil. Remove and destroy infected plant material. Practice field sanitation.
gu: ક્લોરોથેલોનિલ જેવા ફંગસચિપનો ઉપયોગ કરો પ્રભાવિત પાકને દૂર કરો અને નષ્ટ કરો ખેતરો શુદ્ધ રાખો
ur: فنگسائیڈز استعمال کریں، کلو روتھالونل متاثرہ پودوں کو نکال دیں فیلڈ کی صفائی کریں

# cauliflower_healthy
source: Healthy Cauliflower
gu: સ્વસ્થ ફુલકોબી
ur: صحت مند گوبھی

# cauliflower_healthy_preventive
source: Ensure optimal water and nutrient management. Regular pest monitoring. Practice crop rotation.
gu: યોગ્ય પાણી અને પોષણ વ્યવસ્થાપન કરો નિયમિત કીટક તપાસ કરો પાક પરિચયનો અભ્યાસ કરો
ur: صحیح پانی اور غذائیت کی انتظامی حکمت عملی کو یقینی بنائیں پests یا بیماریوں کی باقاعدہ جانچ کریں فصلوں کا تبادلہ کریں

# soybean_healthy
source: Healthy Soybean
gu: સ્વસ્થ સોયાબીન
ur: صحت مند سویا بین

# soybean_healthy_preventive
source: Ensure proper soil nutrition. Regular pest monitoring. Practice crop rotation.
gu: યોગ્ય માટી પોષણ સુનિશ્ચિત કરો નિયમિત કીટક તપાસ કરો પાક પરિચયનો અભ્યાસ કરો
ur: صحیح مٹی کے غذائیت کو یقینی بنائیں پests یا بیماریوں کی باقاعدہ جانچ کریں فصلوں کا تبادلہ کریں

# soybean_caterpillar
source: Caterpillar
gu: કેટરપિલર
ur: کیٹرپلر

# soybean_caterpillar_preventive
source: Use insecticides like Spinosad. Control caterpillar infestations with natural predators.
gu: સ્પિનોસાડ જેવા કીટનાશકોનો ઉપયોગ કરો પ્રાકૃતિક શિકારીઓને ઉપયોગ કરીને કેટરપિલર નિયંત્રણ કરો
ur: انسییکٹیسائیڈز استعمال کریں، اسپینوساد جیسے کیٹرپلر کی آبادی کو قدرتی شکاریوں کے ذریعے کنٹرول کریں

# soybean_diabrotica_speciosa
source: Diabrotica Speciosa (Soybean)
gu: ડાયબ્રોટિકા સ્પેશિયોसा (સોયાબીન)
ur: ڈیبروٹیکا اسپیشیوسا (سویا بین)

# soybean_diabrotica_speciosa_preventive
source: Use insecticides like Thiamethoxam. Practice crop rotation.
gu: થાયામેથોક્સમ જેવા કીટનાશકોનો ઉપયોગ કરો પાક પરિચયનો અભ્યાસ કરો
ur: انسییکٹیسائیڈز استعمال کریں، تھایامیتھوکسام جیسے فصلوں کا تبادلہ کریں

# spinach_healthy
source: Healthy Spinach
gu: સ્વસ્થ પાલક
ur: صحت مند اسپینچ

# spinach_healthy_preventive
source: Ensure optimal water and nutrient management. Regular pest monitoring. Practice crop rotation.
gu: યોગ્ય પાણી અને પોષણ વ્યવસ્થાપન કરો નિયમિત કીટક તપાસ કરો પાક પરિચયનો અભ્યાસ કરો
ur: صحیح پانی اور غذائیت کی انتظامی حکمت عملی کو یقینی بنائیں پests یا بیماریوں کی باقاعدہ جانچ کریں فصلوں کا تبادلہ کریں

# spinach_anthracnose_leaf_spot
source: Anthracnose leaf spot
gu: એન્થ્રાક્નોસ પાનનો ડોગો
ur: آنٹھرکنووس پتے کے دھبے

# spinach_anthracnose_leaf_spot_preventive
source: Apply fungicides like Chlorothalonil. Practice crop rotation. Remove infected plant material.
gu: ક્લોરોથેલોનિલ જેવા ફંગસચિપનો ઉપયોગ કરો પાક પરિચયનો અભ્યાસ કરો પ્રભાવિત પાકને દૂર કરો
ur: فنگسائیڈز استعمال کریں، کلو روتھالونل فصلوں کا تبادلہ کریں متاثرہ پودوں کو نکال دیں

# spinach_straw_mite
source: Straw Mite
gu: સ્ટ્રો માઇટ
ur: سٹراؤ مائٹ

# spinach_straw_mite_preventive
source: Use miticides. Increase humidity to deter mites. Remove infected plants.
gu: માઇટસાઇડનો ઉપયોગ કરો માઇટ્સને રોકવા માટે ઓલાવું વધારવા પ્રભાવિત પાકને દૂર કરો
ur: مائٹ سائیڈز استعمال کریں مائٹس کو روکنے کے لیے نمی کی سطح بڑھائیں متاثرہ پودوں کو نکال دیں

# pomegranate_alternaria
source: Alternaria
gu: અલ્ટરનેરીયા
ur: آلٹرناریا
