// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Marathi (`mr`).
class AppLocalizationsMr extends AppLocalizations {
  AppLocalizationsMr([String locale = 'mr']) : super(locale);

  @override
  String get language => 'मराठी';

  @override
  String get login_heading => 'तुमच्या खात्यात साइन इन करा';

  @override
  String get username => 'वापरकर्तानाव';

  @override
  String get password => 'पासवर्ड';

  @override
  String get signin => 'साइन इन करा';

  @override
  String get signup_txt => 'खाते नाही?';

  @override
  String get signup => 'साइन अप करा';

  @override
  String get signup_heading => 'तुमचे खाते तयार करा';

  @override
  String get name => 'नाव';

  @override
  String get contact => 'संपर्क क्र.';

  @override
  String get confirm => 'पासवर्डची पुष्टी करा';

  @override
  String get signin_txt => 'आधीच खाते आहे?';

  @override
  String get slide1 =>
      'तपशीलवार अंतर्दृष्टी मिळविण्यासाठी चित्रावर क्लिक करा किंवा आपल्या पिकाची प्रतिमा अपलोड करा';

  @override
  String get slide2 => 'रोग ओळखणे आणि त्याचे कारण';

  @override
  String get slide3 => 'प्रतिबंधात्मक उपाय आणि सुचवलेली औषधे';

  @override
  String get slide4 =>
      'पीक लक्षणांचे वर्णन करण्यासाठी आणि रोगांचा अचूक अंदाज लावण्यासाठी एआय चॅटबॉट आणि व्हॉइस असिस्टंट';

  @override
  String get slide5 => 'पीक शिफारसी';

  @override
  String get slide6 => 'आम्हाला तुमचे डिव्हाइस स्थान वापरण्याची परवानगी द्या';

  @override
  String get next => 'पुढे';

  @override
  String get skip => 'वगळा';

  @override
  String get accept => 'स्वीकारा';

  @override
  String get welcome_head => 'मध्ये आपले स्वागत आहे';

  @override
  String get shetkari => 'शेतकरी मध्ये';

  @override
  String get descrp =>
      'तुमच्या शेताचे रक्षण करण्यासाठी आणि उत्पादन वाढवण्यासाठी रीअल-टाइम अंदाज, कृती करण्यायोग्य अंतर्दृष्टी आणि तज्ञांच्या सल्ल्यासह पीक रोगांचे व्यवस्थापन करणारे abd शोधण्यात तुमचा विश्वासू सहकारी.';

  @override
  String get picture => 'क्लिक करा किंवा प्रतिमा अपलोड करा';

  @override
  String get or => 'किंवा';

  @override
  String get profile => 'प्रोफाइल';

  @override
  String get edit_pfp => 'प्रोफाइल संपादित करा';

  @override
  String get history => 'इतिहास';

  @override
  String get saved => 'जतन केले';

  @override
  String get signout => 'साइन आउट करा';

  @override
  String get contact_us => 'आमच्याशी संपर्क साधा';

  @override
  String get icon_desp => 'चिन्ह वर्णन';

  @override
  String get page1 => 'मुखपृष्ठ';

  @override
  String get page2 => 'रोग शोधणे';

  @override
  String get page3 => 'प्रतिबंधात्मक उपाय';

  @override
  String get page4 => 'चॅटबॉट';

  @override
  String get page5 => 'आवाज सहाय्य';

  @override
  String get page6 => 'शिफारशी';

  @override
  String get page1_s1 => 'रोग बद्दल';

  @override
  String get page1_s2 => 'रोगाची कारणे';

  @override
  String get page6_s1 => 'सूचक पिके';

  @override
  String get apple => 'सफरचंद';

  @override
  String get cotton => 'कापूस';

  @override
  String get cauliflower => 'फूलकोबी';

  @override
  String get maize => 'मका';

  @override
  String get pomegranate => 'डाळिंब';

  @override
  String get rice => 'तांदूळ';

  @override
  String get sugarcane => 'ऊस';

  @override
  String get soyabean => 'सोयाबीन';

  @override
  String get spinach => 'पालक';

  @override
  String get tomato => 'टोमॅटो';

  @override
  String get apple_scab => 'सापलाचे स्कॅब';

  @override
  String get apple_scab_preventive =>
      'पिकांच्या मध्ये योग्य अंतर ठेवा ज्यामुळे हवा नीट फिरू शकेल\nमांकोझेब किंवा तांब्याचे आधारित उत्पादने वापरा\nप्रभावित क्षेत्रांची छाटणी करा आणि पडलेल्या पानांचे निवारण करा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे\nजास्त ओलाव्यापासून बचाव करण्यासाठी योग्य पाणी देण्याची पद्धत ठेवा';

  @override
  String get apple_black_rot => 'सापलाची काळी सड';

  @override
  String get apple_black_rot_preventive =>
      'पिकांच्या मध्ये योग्य अंतर ठेवा ज्यामुळे हवा नीट फिरू शकेल\nमांकोझेब किंवा तांब्याचे आधारित उत्पादने वापरा\nप्रभावित क्षेत्रांची छाटणी करा आणि पडलेल्या पानांचे निवारण करा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे\nजास्त ओलाव्यापासून बचाव करण्यासाठी योग्य पाणी देण्याची पद्धत ठेवा';

  @override
  String get apple_cedar_apple_rust => 'सापलाचा सीडर सापलाचे संडाळ';

  @override
  String get apple_cedar_apple_rust_preventive =>
      'पिकांच्या मध्ये योग्य अंतर ठेवा ज्यामुळे हवा नीट फिरू शकेल\nमांकोझेब किंवा तांब्याचे आधारित उत्पादने वापरा\nप्रभावित क्षेत्रांची छाटणी करा आणि पडलेल्या पानांचे निवारण करा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे\nजास्त ओलाव्यापासून बचाव करण्यासाठी योग्य पाणी देण्याची पद्धत ठेवा';

  @override
  String get apple_healthy => 'स्वस्थ सापल';

  @override
  String get apple_healthy_preventive =>
      'पिकांची योग्य देखभाल, योग्य पाणी आणि पोषणाचे व्यवस्थापन करा\nपानांची किंवा पिकांची नियमितपणे तपासणी करा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे';

  @override
  String get rice_tungro => 'तंगरो';

  @override
  String get rice_tungro_preventive =>
      'प्रतिरोधक चवळीच्या जाती वापरा\nकीटक नियंत्रित करण्यासाठी कीटनाशकांचा वापर करा\nक्षेत्र स्वच्छ ठेवा\nअधिक नायट्रोजन खतांच्या वापरावर नियंत्रण ठेवा';

  @override
  String get rice_blast =>
      'तांदळामधील ब्लास्ट रोग हा बुरशीनाशकांचा वापर करून नियंत्रित केला जाऊ शकतो, जसे की पाइरिक्युलारिया किंवा ट्रायसायक्लाझोल. हे बुरशीनाशक रोगाचे व्यवस्थापन करण्यास आणि निरोगी झाडांमध्ये प्रसार टाळण्यास मदत करतात. तांदळाच्या प्रतिरोधक प्रकारांचा उपयोग करून ब्लास्टचा प्रभाव कमी करता येतो. योग्य सिंचन व जलनिचरा पद्धती राखणे आवश्यक आहे, कारण स्थिर पाणी बुरशीच्या वाढीस प्रोत्साहन देते. हवेचा प्रवाह सुधारण्यासाठी आणि ओलावा कमी करण्यासाठी योग्य झाडांमधील अंतर ठेवा. रोगाचा पुढील प्रसार रोखण्यासाठी संक्रमित झाडे त्वरीत काढून टाका आणि नष्ट करा. अतिसंवेदनशील नसलेल्या पिकांसह पीक फेरपालट केल्याने भविष्यात तांदळाच्या ब्लास्टचा पुनरावृत्तीचा धोका कमी होतो.';

  @override
  String get rice_blast_preventive =>
      'पायरिक्युलरिया किंवा ट्रायसायक्लाझोल यासारख्या फंगिसाइड्सचा वापर करा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे\nप्रतिरोधक चवळीच्या जाती वापरा';

  @override
  String get rice_brownspot => 'ब्राऊनस्पॉट';

  @override
  String get rice_brownspot_preventive =>
      'संक्रमित चवळीच्या पिकांना काढा\nकार्बेंडाझिम यासारख्या फंगिसाइड्सचा वापर करा\nयोग्य सिंचन पद्धतींचा अवलंब करा';

  @override
  String get rice_bacterial_blight => 'बॅक्टेरियल ब्लाइट';

  @override
  String get rice_bacterial_blight_preventive =>
      'प्रतिरोधक जाती वापरा\nसिंचन पद्धती योग्य ठेवा\nस्वच्छ बीजांचा वापर करा';

  @override
  String get sugarcane_yellow_rust => 'पिवळा संडाळ';

  @override
  String get sugarcane_yellow_rust_preventive =>
      'प्रोपिकोनाझोल यासारख्या फंगिसाइड्सचा वापर करा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे\nसंक्रमित पिकांना काढा आणि नष्ट करा';

  @override
  String get sugarcane_red_rot => 'लाल सड';

  @override
  String get sugarcane_red_rot_preventive =>
      'रोगमुक्त रोपण सामग्री वापरा\nकीटकांचा प्रसार नियंत्रित करा\nथायोफेनेट-मेथिल यासारख्या फंगिसाइड्सचा वापर करा';

  @override
  String get sugarcane_red_rust => 'लाल संडाळ';

  @override
  String get sugarcane_red_rust_preventive =>
      'गांजा नियंत्रित करा\nप्रतिरोधक जाती वापरा\nतांब्याचे आधारित उत्पादने वापरा';

  @override
  String get sugarcane_mosaic => 'मोजेक';

  @override
  String get sugarcane_mosaic_preventive =>
      'प्रतिरोधक जाती वापरा\nआफिड्स आणि इतर कीटकांचा प्रसार नियंत्रित करा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे';

  @override
  String get sugarcane_healthy => 'स्वस्थ गहू';

  @override
  String get sugarcane_healthy_preventive =>
      'योग्य पाणी आणि पोषण व्यवस्थापन ठेवा\nनियमित कीटक निरीक्षण करा\nक्षेत्र स्वच्छ ठेवा';

  @override
  String get tomato_bacterial_spot => 'बॅक्टेरियल स्पॉट';

  @override
  String get tomato_bacterial_spot_preventive =>
      'तांब्याचे आधारित फंगिसाइड्सचा वापर करा\nऊपरी सिंचन टाळा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे';

  @override
  String get tomato_early_blight => 'लवकर ब्लाइट';

  @override
  String get tomato_early_blight_preventive =>
      'क्लोरोथॅलोनिल यासारख्या फंगिसाइड्सचा वापर करा\nसंक्रमित पिकांना काढा आणि नष्ट करा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे';

  @override
  String get tomato_late_blight => 'उशिरा ब्लाइट';

  @override
  String get tomato_late_blight_preventive =>
      'मेटालॅक्सिल यासारख्या फंगिसाइड्सचा वापर करा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे\nसंक्रमित पिकांना काढा आणि नष्ट करा';

  @override
  String get tomato_leaf_mold => 'पानांचा मोल्ड';

  @override
  String get tomato_leaf_mold_preventive =>
      'पिकांच्या मध्ये योग्य अंतर ठेवा\nग्रीनहाऊसमध्ये ओलावा नियंत्रित करा\nक्लोरोथॅलोनिल यासारख्या फंगिसाइड्सचा वापर करा';

  @override
  String get tomato_septoria_leaf_spot => 'सेप्टोरिया पानांचा डाग';

  @override
  String get tomato_septoria_leaf_spot_preventive =>
      'मांकोझेब यासारख्या फंगिसाइड्सचा वापर करा\nसंक्रमित पिकांना काढा आणि नष्ट करा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे';

  @override
  String get tomato_spider_mites => 'स्पायडर माइट्स (टू-स्पॉटेड स्पायडर माइट)';

  @override
  String get tomato_spider_mites_preventive =>
      'माइटसाइड्सचा वापर करा\nमाइट्सला रोखण्यासाठी ओलावा वाढवा\nसंक्रमित पिकांना काढा';

  @override
  String get tomato_target_spot => 'टार्गेट स्पॉट';

  @override
  String get tomato_target_spot_preventive =>
      'पाय्राक्लोस्ट्रोबिन यासारख्या फंगिसाइड्सचा वापर करा\nसिंचन पद्धतींचा अवलंब करा\nसंक्रमित पिकांना काढा';

  @override
  String get tomato_ytlcv => 'टमाटर येलो लीफ कर्ल वायरस (TYLCV)';

  @override
  String get tomato_ytlcv_preventive =>
      'व्हाइटफ्लायची संख्या नियंत्रित करा\nप्रतिरोधक टमाटर जात वापरा\nसंक्रमित पिकांना काढा';

  @override
  String get tomato_healthy => 'स्वस्थ टमाटर';

  @override
  String get tomato_healthy_preventive =>
      'योग्य पाणी आणि उर्वरक व्यवस्थापन ठेवा\nनियमित कीटक आणि रोग निरीक्षण करा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे';

  @override
  String get cotton_bacterial_blight => 'बॅक्टेरियल ब्लाइट';

  @override
  String get cotton_bacterial_blight_preventive =>
      'प्रतिरोधक कापूस प्रकार वापरा\nसंक्रमित पिकांना काढा आणि नष्ट करा\nपीकांची पुनरावृत्ती टाळण्यासाठी चांगला पद्धतीने फटका देणे';

  @override
  String get cotton_aphid => 'कापसाचे ऐफिड';

  @override
  String get cotton_aphid_preventive =>
      'इमिडाक्लोप्रिड यासारख्या कीटनाशकांचा वापर करा\nप्राकृतिक शिकारी वापरून ऐफिडसची संख्या नियंत्रित करा';

  @override
  String get cotton_whitefly => 'कापसाची पांढरी माशी';

  @override
  String get cotton_whitefly_preventive =>
      'थायामेथोक्सम यासारख्या कीटनाशकांचा वापर करा\nप्राकृतिक शिकारी जसे की लेडीबग्स वापरून संख्या नियंत्रित करा';

  @override
  String get cotton_anthracnose => 'एंथ्राक्नोस';

  @override
  String get cotton_anthracnose_preventive =>
      'क्लोरोथॅलोनिल यासारख्या फंगिसाइड्सचा वापर करा\nक्षेत्र स्वच्छ ठेवा\nसंक्रमित पिकांना काढा आणि नष्ट करा';

  @override
  String get cotton_healthy => 'स्वस्थ कापूस';

  @override
  String get cotton_healthy_preventive =>
      'योग्य पाणी आणि पोषक तत्वांचे व्यवस्थापन ठेवा\nनियमित कीटक निरीक्षण करा\nप्रतिरोधक प्रकार वापरा';

  @override
  String get cotton_red_cotton_bug => 'लाल कापूस बग';

  @override
  String get cotton_red_cotton_bug_preventive =>
      'मालाथियान यासारख्या कीटनाशकांचा वापर करा\nप्राकृतिक शिकारी प्रोत्साहित करा';

  @override
  String get cauliflower_downy_mildew => 'डाउनी मिल्ड्यू';

  @override
  String get cauliflower_downy_mildew_preventive =>
      'मेटालॅक्सिल यासारख्या फंगिसाइड्सचा वापर करा\nपिकांच्या मध्ये योग्य अंतर ठेवा\nसंक्रमित पिकांना काढा';

  @override
  String get cauliflower_bacterial_spot_rot => 'बॅक्टेरियल स्पॉट सड';

  @override
  String get cauliflower_bacterial_spot_rot_preventive =>
      'कॉपर सल्फेट यासारख्या बॅक्टेरियासाइड्सचा वापर करा\nपीक घुमावाचा अवलंब करा\nयोग्य सिंचन पद्धती वापरा';

  @override
  String get cauliflower_black_rot => 'काळा सड';

  @override
  String get cauliflower_black_rot_preventive =>
      'क्लोरोथॅलोनिल यासारख्या फंगिसाइड्सचा वापर करा\nसंक्रमित पिकांना काढा आणि नष्ट करा\nक्षेत्र स्वच्छ ठेवा';

  @override
  String get cauliflower_healthy => 'स्वस्थ फुलकोबी';

  @override
  String get cauliflower_healthy_preventive =>
      'योग्य पाणी आणि पोषक तत्वांचे व्यवस्थापन ठेवा\nनियमित कीटक निरीक्षण करा\nपीक घुमावाचा अवलंब करा';

  @override
  String get soybean_healthy => 'स्वस्थ सोयाबीन';

  @override
  String get soybean_healthy_preventive =>
      'योग्य माती पोषण सुनिश्चित करा\nनियमित कीटक निरीक्षण करा\nपीक घुमावाचा अवलंब करा';

  @override
  String get soybean_caterpillar => 'केटरपिलर';

  @override
  String get soybean_caterpillar_preventive =>
      'स्पिनोसाड यासारख्या कीटनाशकांचा वापर करा\nप्राकृतिक शिकारी वापरून केटरपिलर नियंत्रित करा';

  @override
  String get soybean_diabrotica_speciosa =>
      'डायब्रोमॅटिका स्पेशियोसा (सोयाबीन)';

  @override
  String get soybean_diabrotica_speciosa_preventive =>
      'थायामेथोक्सम यासारख्या कीटनाशकांचा वापर करा\nपीक घुमावाचा अवलंब करा';

  @override
  String get spinach_healthy => 'स्वस्थ पालक';

  @override
  String get spinach_healthy_preventive =>
      'योग्य पाणी आणि पोषक तत्वांचे व्यवस्थापन ठेवा\nनियमित कीटक निरीक्षण करा\nपीक घुमावाचा अवलंब करा';

  @override
  String get spinach_anthracnose_leaf_spot => 'एंथ्राक्नोस पानांचे डाग';

  @override
  String get spinach_anthracnose_leaf_spot_preventive =>
      'क्लोरोथॅलोनिल यासारख्या फंगिसाइड्सचा वापर करा\nपीक घुमावाचा अवलंब करा\nसंक्रमित पिकांना काढा';

  @override
  String get spinach_straw_mite => 'स्ट्रॉ माइट';

  @override
  String get spinach_straw_mite_preventive =>
      'माइटसाइड्सचा वापर करा\nमाइट्सला रोखण्यासाठी ओलावा वाढवा\nसंक्रमित पिकांना काढा';

  @override
  String get pomegranate_alternaria => 'अल्टरनेरिया';

  @override
  String get pomegranate_alternaria_preventive =>
      'पिकांच्या मध्ये योग्य अंतर ठेवा ज्यामुळे हवा नीट फिरू शकेल\nमांकोझेब किंवा तांब्याचे आधारित उत्पादने वापरा\nप्रभावित क्षेत्रांची छाटणी करा आणि पडलेल्या पानांचे निवारण करा\nपीक घुमावाचा अभ्यास करा ज्यामुळे रोगाचा प्रसार कमी होईल\nअधिक ओलाव्यापासून बचाव करण्यासाठी योग्य पाणी देण्याची पद्धत ठेवा';

  @override
  String get pomegranate_anthracnose => 'एंथ्राक्नोस';

  @override
  String get pomegranate_anthracnose_preventive =>
      'तांब्याचे आधारित उत्पादने वापरा\nप्रभावित क्षेत्रांची छाटणी करा आणि पडलेल्या पानांचे निवारण करा\nपीक घुमावाचा अभ्यास करा';

  @override
  String get pomegranate_cercospora => 'सेरकोस्पोरा';

  @override
  String get pomegranate_cercospora_preventive =>
      'मांकोझेब यासारख्या फंगिसाइड्सचा वापर करा\nपीक घुमावाचा अभ्यास करा\nसंक्रमित पिकांना काढा आणि नष्ट करा';

  @override
  String get pomegranate_bacterial_blight => 'बॅक्टेरियल ब्लाइट';

  @override
  String get pomegranate_bacterial_blight_preventive =>
      'प्रतिरोधक जाती वापरा\nयोग्य सिंचन पद्धती वापरा\nसंक्रमित पिकांना काढा';

  @override
  String get pomegranate_healthy => 'स्वस्थ';

  @override
  String get pomegranate_healthy_preventive =>
      'योग्य पाणी आणि पोषक तत्वांचे व्यवस्थापन ठेवा\nनियमित कीटक निरीक्षण करा\nपीक घुमावाचा अवलंब करा';

  @override
  String get maize_cercospora_leaf_spot => 'सेरकोस्पोरा पानांच्या डाग';

  @override
  String get maize_cercospora_leaf_spot_preventive =>
      'मांकोझेब यासारख्या फंगिसाइड्सचा वापर करा\nपीक घुमावाचा अभ्यास करा\nसंक्रमित पिकांना काढा';

  @override
  String get maize_common_rust => 'सामान्य संडाळ';

  @override
  String get maize_common_rust_preventive =>
      'क्लोरोथॅलोनिल यासारख्या फंगिसाइड्सचा वापर करा\nपीक घुमावाचा अभ्यास करा\nसंक्रमित पिकांना काढा';

  @override
  String get maize_healthy => 'स्वस्थ';

  @override
  String get maize_healthy_preventive =>
      'योग्य पाणी आणि पोषक तत्वांचे व्यवस्थापन ठेवा\nनियमित कीटक निरीक्षण करा\nपीक घुमावाचा अवलंब करा';

  @override
  String get maize_northern_leaf_blight => 'नॉर्दर्न लीफ ब्लाइट';

  @override
  String get maize_northern_leaf_blight_preventive =>
      'प्रोपिकोनाझोल यासारख्या फंगिसाइड्सचा वापर करा\nक्षेत्र स्वच्छ ठेवा\nसंक्रमित पिकांना काढा';

  @override
  String get yojna_no_1_name => 'प्रधानमंत्री किसान सन्मान निधी ';

  @override
  String get yojna_no_1_desc =>
      'लहान आणि अल्पभूधारक शेतकऱ्यांना आर्थिक मदत प्रदान करणारी योजना. या योजनेतून शेतकऱ्यांच्या बँक खात्यात दरवर्षी तीन हप्त्यांमध्ये ६,००० रुपये थेट हस्तांतरित केले जातात. ही योजना शेतकऱ्यांना कृषी इनपुट, घरगुती खर्च आणि इतर गरजा पूर्ण करण्यात मदत करते. थेट लाभ हस्तांतरण प्रणालीमुळे पारदर्शकता आणि कार्यक्षमता सुनिश्चित होते आणि मध्यस्थ काढून टाकले जातात.';

  @override
  String get yojna_no_2_name => 'प्रधानमंत्री पीक विमा योजना ';

  @override
  String get yojna_no_2_desc =>
      'नैसर्गिक आपत्ती जसे की पूर, दुष्काळ, कीड आणि रोगांपासून पिकांचे संरक्षण करण्यासाठी व्यापक विमा कव्हरेज प्रदान करणारी योजना. शेतकरी नाममात्र प्रीमियम भरतात, उर्वरित रक्कम सरकारकडून सबसिडी दिली जाते. ही योजना शेतकऱ्यांना हवामानातील अनिश्चितता आणि पीक नुकसानीपासून स्थिरता प्रदान करते.';

  @override
  String get yojna_no_3_name => 'मृदा आरोग्य कार्ड योजना';

  @override
  String get yojna_no_3_desc =>
      'शेतकऱ्यांना त्यांच्या जमिनीतील पोषक तत्वांची स्थिती आणि सुपीकतेचे तपशील देणारे मृदा आरोग्य कार्ड प्रदान करते. ही योजना शेतकऱ्यांना योग्य प्रमाणात खते वापरण्याबद्दल मार्गदर्शन करते, ज्यामुळे उत्पादनक्षमता सुधारते आणि रासायनिक खतांचा अतिरेक टाळला जातो.';

  @override
  String get yojna_no_4_name => 'किसान क्रेडिट कार्ड ';

  @override
  String get yojna_no_4_desc =>
      'शेतकऱ्यांना बियाणे, खते, उपकरणे आणि सिंचनासाठी स्वस्त आणि सोपे कर्ज उपलब्ध करून देते. कमी व्याजदर आणि लवचिक परतफेडीच्या अटींसह ही योजना शेतकऱ्यांचा आर्थिक ताण कमी करते. ही योजना फळे, भाजीपाला आणि इतर उत्पादनांसाठी सुधारणेसाठी मदत करते.';

  @override
  String get yojna_no_5_name => 'प्रधानमंत्री कृषी सिंचन योजना ';

  @override
  String get yojna_no_5_desc =>
      'सिंचनाची कार्यक्षमता सुधारण्यासाठी आणि प्रत्येक शेतात पाणी पोहोचवण्यासाठी मदत करणारी योजना. पाण्याच्या संवर्धनावर भर देऊन अधिक क्षेत्र लागवडीखाली आणण्यावर ही योजना भर देते.';

  @override
  String get yojna_no_6_name => 'राष्ट्रीय कृषी विकास योजना ';

  @override
  String get yojna_no_6_desc =>
      'राज्यस्तरीय प्रकल्पांसाठी निधी देणारी योजना जी स्थानिक अडचणी सोडवते आणि उत्पादनक्षमता वाढवते. आधुनिक तंत्रज्ञान, प्रशिक्षण कार्यक्रम आणि उच्च मूल्याच्या पिकांवर लक्ष केंद्रित करते.';

  @override
  String get yojna_no_7_name => 'राष्ट्रीय कृषी बाजार ';

  @override
  String get yojna_no_7_desc =>
      'शेतकऱ्यांना देशभरातील खरेदीदारांशी जोडणारे डिजिटल व्यापार मंच. यात शेतमालासाठी चांगल्या किंमती मिळवून देण्यासाठी पारदर्शकता आणि सुविधा प्रदान केल्या जातात.';

  @override
  String get yojna_no_8_name => 'पारंपारिक कृषी विकास योजना ';

  @override
  String get yojna_no_8_desc =>
      'सेंद्रिय शेतीसाठी आर्थिक सहाय्य आणि प्रशिक्षण देणारी योजना. जैव खतांचा वापर आणि रसायनांचा कमी वापर करण्यास प्रोत्साहन देते.';

  @override
  String get yojna_no_9_name => 'शेतकरी व्याज अनुदान योजना';

  @override
  String get yojna_no_9_desc =>
      'शेतकऱ्यांना अल्पकालीन शेतीसाठी कमी व्याजदरावर कर्ज उपलब्ध करून देते. वेळेवर परतफेड करणाऱ्या शेतकऱ्यांना अतिरिक्त सवलत दिली जाते.';

  @override
  String get yojna_no_10_name => 'खते सबसिडी योजना';

  @override
  String get yojna_no_10_desc =>
      'शेतकऱ्यांना सवलतीच्या दरात खते उपलब्ध करून देते, ज्यामुळे उत्पादन खर्च कमी होतो. योग्य प्रमाणात खतांचा वापर करून उत्पादनक्षमता सुधारली जाते.';

  @override
  String get yojna_no_11_name => 'राष्ट्रीय अन्न सुरक्षा अभियान ';

  @override
  String get yojna_no_11_desc =>
      'तांदूळ, गहू, डाळी आणि इतर अनाजांचे उत्पादन वाढवण्यासाठी शेतकऱ्यांना मदत करणारी योजना. गुणवत्तापूर्ण बियाणे, प्रशिक्षण, आणि आर्थिक सहाय्य उपलब्ध करून देते.';

  @override
  String get yojna_no_12_name => 'ग्रामीण भांडार योजना';

  @override
  String get yojna_no_12_desc =>
      'शेतमाल सुरक्षित साठवण्यासाठी ग्रामीण गोदामांच्या उभारणीसाठी सहाय्य करणारी योजना. शेतकऱ्यांना बाजारात चांगल्या किंमती मिळवून देण्यास मदत करते.';

  @override
  String get yojna_no_13_name => 'प्रधानमंत्री किसान मानधन योजना ';

  @override
  String get yojna_no_13_desc =>
      '६० वर्षांनंतर शेतकऱ्यांना दरमहा ३,००० रुपये पेंशन देणारी योजना. ही योजना शेतकऱ्यांना वृद्धापकाळात आर्थिक सुरक्षितता प्रदान करते.';

  @override
  String get yojna_no_14_name => 'डिजिटल कृषी मिशन';

  @override
  String get yojna_no_14_desc =>
      'तंत्रज्ञानाच्या मदतीने शेती सुधारण्यावर भर देते. शेतकऱ्यांना हवामानाच्या अद्यतने, पीक शिफारशी, आणि डेटा विश्लेषणामध्ये मदत करते.';

  @override
  String get yojna_no_15_name => 'फसल विज्ञान आणि पोषण सुरक्षा';

  @override
  String get yojna_no_15_desc =>
      'दुष्काळ आणि पूरसारख्या परिस्थितीला तोंड देणाऱ्या पिकांच्या संशोधन आणि उत्पादनाला प्रोत्साहन देणारी योजना.';

  @override
  String get yojna_no_16_name => 'बागायती विकास योजना';

  @override
  String get yojna_no_16_desc =>
      'फळे, भाजीपाला, आणि फुलपिकांच्या आधुनिक लागवडीसाठी आर्थिक व तांत्रिक सहाय्य प्रदान करते.';

  @override
  String get yojna_no_17_name =>
      '१०,००० शेतकरी उत्पादक संघटना  प्रोत्साहन योजना';

  @override
  String get yojna_no_17_desc =>
      'शेतमालाच्या सामूहिक विक्रीसाठी शेतकऱ्यांना गट तयार करण्यासाठी प्रोत्साहित करते.';

  @override
  String get yojna_no_18_name => 'कृषी पायाभूत सुविधा निधी ';

  @override
  String get yojna_no_18_desc =>
      'पोस्ट-हार्वेस्ट इन्फ्रास्ट्रक्चर उभारण्यासाठी शेतकऱ्यांना कर्ज उपलब्ध करून देते.';

  @override
  String get yojna_no_19_name =>
      'बाजार हस्तक्षेप योजना आणि किंमत समर्थन योजना ';

  @override
  String get yojna_no_19_desc =>
      'अधिक पुरवठ्याच्या वेळी योग्य किंमती सुनिश्चित करून शेतकऱ्यांना नुकसान टाळते.';

  @override
  String get page_3 => 'शिफारस करणारे';

  @override
  String get enter_farm_details =>
      'आम्हाला पुढील हंगामासाठी काही पिके शिफारस करण्यात मदत करण्यासाठी तुमच्या शेताची माहिती प्रविष्ट करा:';

  @override
  String get n_content => 'नायट्रोजन (N) सामग्री';

  @override
  String get p_content => 'फॉस्फरस (P) सामग्री';

  @override
  String get k_content => 'पोटॅशियम (K) सामग्री';

  @override
  String get temp => 'तापमान (°C)';

  @override
  String get humidity => 'आर्द्रता (%)';

  @override
  String get soil_ph => 'मृदा पीएच';

  @override
  String get rain => 'पाऊस (मिमी)';

  @override
  String get get_recommend => 'शिफारसी मिळवा';

  @override
  String get page_4 => 'व्हॉइस असिस्टंट';

  @override
  String get enter_a_text => 'एक संदेश टाइप करा...';

  @override
  String get recommended => 'शिफारस केलेले पीक';

  @override
  String get page_5 => 'प्रतिबंधक उपाय';

  @override
  String get selection => 'एक पीक निवडा';

  @override
  String get deafult_page_5 => 'रोग पाहण्यासाठी कृपया एक पीक निवडा.';

  @override
  String get page_6 => 'शासकीय योजना';

  @override
  String get alternaria_pomegranate =>
      'अनारातील अल्टरनेरिया रोग नियंत्रित करण्यासाठी मॅन्कोझेब किंवा क्लोरोथालोनिल यांसारख्या बुरशीनाशकांचा उपयोग करा, जे बुरशीच्या वाढीला थोपवतात. संक्रमित फांद्या छाटणे आणि पडलेल्या पानांचे विल्हेवाट लावणे यामुळे रोगाचा प्रसार कमी होतो. झाडाभोवती चांगला हवेचा प्रवाह सुनिश्चित करा जेणेकरून जास्त ओलावा होणार नाही. योग्य सिंचन पद्धती पाळणे आणि बुरशीच्या बीजाणूंचा प्रसार कमी करण्यासाठी ओव्हरहेड सिंचन टाळणे आवश्यक आहे. रोगास संवेदनाक्षम नसलेल्या पिकांसह पीक फेरपालट करणे आणि रोगमुक्त रोपांचा वापर करणे भविष्यातील प्रादुर्भाव टाळण्यास मदत करू शकते.';

  @override
  String get anthracnose_pomegranate =>
      'अनारातील ऍन्थ्रॅक्नोज रोग नियंत्रित करण्यासाठी प्रोपिकोनाझोलसारखे प्रणालीगत बुरशीनाशक किंवा तांब्याच्या आधारे तयार केलेले बुरशीनाशक वापरा. संक्रमित फळे, पाने आणि फांद्या काढून टाकणे आणि नष्ट करणे आवश्यक आहे. जलभराव टाळण्यासाठी योग्य निचरा सुनिश्चित करा आणि ओलावा कमी करा, कारण हा रोग ओलसर वातावरणात पसरतो. गंभीर प्रकरणांमध्ये, फुलांच्या टप्प्यात विशेषतः बुरशीनाशकाचा दुसरा डोस आवश्यक असतो. झाडांना जास्त सिंचन किंवा पोषणाच्या असमतोलामुळे होणाऱ्या ताणापासून वाचवणे महत्त्वाचे आहे. रोग प्रतिकारक प्रकारांचा वापर करून ऍन्थ्रॅक्नोजची घटना कमी करता येते.';

  @override
  String get bacterial_blight_in_cotton =>
      'कापूस पिकावर होणारा जीवाणू अंगमारी हा रोग प्रतिरोधक कापूस प्रकार वापरून व क्षेत्र स्वच्छता राखून नियंत्रित केला जाऊ शकतो. जीवाणू संसर्ग रोखण्यासाठी तांब्याच्या आधारे तयार केलेले जीवाणुनाशक वापरा. ओलावा तयार होण्यापासून रोखण्यासाठी ओव्हरहेड सिंचन टाळा, जे जीवाणूंच्या वाढीस प्रोत्साहन देते. झाडांभोवती हवेचा प्रवाह सुधारण्यासाठी आणि ओलावा कमी करण्यासाठी झाडांमध्ये योग्य अंतर ठेवा. संक्रमित वनस्पती साहित्य नियमितपणे काढून टाका आणि नष्ट करा. तण नियंत्रणामुळेही जीवाणूंच्या प्रसाराचा धोका कमी होतो. पुनःसंसर्ग कमी करण्यासाठी अतिथी नसलेल्या पिकांसह पीक फेरपालट करण्याचा सल्ला दिला जातो. जीवाणू प्रसरण करणाऱ्या कीटकांचा देखील योग्य प्रकारे सामना करणे महत्त्वाचे आहे.';

  @override
  String get bacterial_blight_pomegranate =>
      'अनारातील जीवाणू अंगमारी नियंत्रित करण्यासाठी संक्रमित फांद्या व पाने छाटणे आणि काढून टाकणे आवश्यक आहे. जीवाणूंच्या वाढीस प्रतिबंध करण्यासाठी तांब्याच्या आधारे तयार केलेले जीवाणुनाशक वापरा आणि क्षेत्राची योग्य स्वच्छता सुनिश्चित करा. झाडाभोवती अतिरिक्त ओलावा टाळण्यासाठी योग्य जलव्यवस्थापन पद्धती राखा, कारण जीवाणू ओलसर परिस्थितीत वाढतात. पाण्याचे उडणे कमी करण्यासाठी आणि जीवाणूंच्या प्रसाराला प्रतिबंध करण्यासाठी ठिबक सिंचनाची शिफारस केली जाते. पडलेली पाने आणि फळे काढून टाकणे आणि झाडाभोवतीचा परिसर स्वच्छ ठेवणे महत्त्वाचे आहे. निरोगी झाडांमध्ये संसर्ग होऊ नये म्हणून संक्रमित झाडे नष्ट करणे आवश्यक आहे. प्रतिकारक प्रकारांचा वापर करून रोग नियंत्रण आणखी चांगले करता येते.';

  @override
  String get bacterial_blight_in_rice =>
      'तांदळामध्ये जीवाणू अंगमारी प्रतिरोधक प्रकारांच्या वापराने नियंत्रित केली जाऊ शकते. प्रभावी नियंत्रणासाठी हंगामाच्या सुरुवातीला तांब्याच्या आधारे तयार केलेले जीवाणुनाशक लावा. ओव्हरहेड सिंचन टाळा कारण पाण्याच्या थेंबांमुळे जीवाणू पसरतात. पाणी साचणे टाळण्यासाठी योग्य निचरा सुनिश्चित करा, कारण ते जीवाणूंच्या वाढीस उत्तेजन देते. संक्रमित झाडे त्वरीत नष्ट करा आणि पुनःसंसर्गाचा धोका कमी करण्यासाठी पीक फेरपालट पाळा. तांदळाच्या झाडांमधील योग्य अंतर वायुप्रवाह सुधारण्यासाठी मदत करते आणि रोगाचा प्रसार कमी करते. अशा शेतांमध्ये लागवड करू नका जिथे पूर्वी जीवाणू अंगमारी झाली आहे, कारण जीवाणू अनेक वर्षे मातीमध्ये टिकून राहू शकतात.';

  @override
  String get brownspot_rice =>
      'तांदळामधील ब्राऊनस्पॉट रोग ट्रायसायक्लाझोल किंवा कार्बेंडाझिमसारख्या बुरशीनाशकांचा उपयोग करून नियंत्रित केला जाऊ शकतो. हे बुरशीनाशक बुरशीच्या वाढीचे व्यवस्थापन करण्यात आणि रोगाचा प्रसार रोखण्यात मदत करतात. योग्य सिंचन व्यवस्थापन सुनिश्चित करा, कारण पाणी साचल्यामुळे बुरशीचा विकास होतो. संक्रमित पाने आणि अवशेष काढून टाका आणि नष्ट करा. अतिसंवेदनशील नसलेल्या पिकांसह पीक फेरपालट रोगाची पुनरावृत्ती कमी करण्यास मदत करते. तांदळाच्या झाडांना जास्त खत देणे टाळा, कारण त्यामुळे बुरशी संक्रमणासाठी अनुकूल परिस्थिती निर्माण होऊ शकते. प्रतिरोधक तांदूळ प्रकारांची निवड करणे आणि चांगले पोषण राखणे ब्राऊनस्पॉटची घटना कमी करण्यास मदत करते.';

  @override
  String get cercospora_pomegranate =>
      'अनारामधील सेर्कोस्पोरा रोग प्रोपिकोनाझोल किंवा तांब्याच्या आधारे तयार केलेल्या बुरशीनाशकांच्या वापराने नियंत्रित केला जाऊ शकतो. हे बुरशीनाशक बुरशीजन्य संक्रमण नियंत्रित करण्यात आणि रोगाचा प्रसार कमी करण्यात प्रभावी ठरतात. संक्रमित पाने व फांद्या छाटणे व काढून टाकणे आवश्यक आहे. बुरशीजन्य वाढीला चालना देणारी अतिरिक्त ओलावा टाळण्यासाठी योग्य सिंचन व जलनिचरा सुनिश्चित करा. प्रतिरोधक प्रकारांच्या वापराने किंवा अतिसंवेदनशील नसलेल्या पिकांसह पीक फेरपालट केल्याने पुनःसंसर्गाची शक्यता कमी होते. झाडांमध्ये योग्य अंतर ठेवल्याने हवेचा प्रवाह सुधारतो, ज्यामुळे बुरशीजन्य संक्रमणाला अनुकूल परिस्थिती कमी होते.';

  @override
  String get lemoncroton =>
      'लिंबू क्रोटन, जो विविध पिकांवर प्रभाव करतो, तो थायोफेनेट-मिथाइल किंवा क्लोरोथालोनिलसारख्या बुरशीनाशकांद्वारे नियंत्रित केला जाऊ शकतो. हे बुरशीनाशक बुरशीच्या वाढीला प्रतिबंध करतात आणि पुढील प्रसार रोखतात. झाडांभोवती योग्य अंतर आणि वायुप्रवाह सुनिश्चित करा, ज्यामुळे ओलावा कमी होतो. पाणी साचणे टाळण्यासाठी योग्य माती निचरा राखा. झाडांचे नियमित निरीक्षण करा आणि संक्रमित पाने किंवा फांद्या काढून टाका. स्वच्छता पद्धती जसे की उपकरणे स्वच्छ ठेवणे बुरशीचा प्रसार रोखण्यात मदत करू शकतात. ज्या भागांमध्ये पूर्वी लिंबू क्रोटनची समस्या होती, तेथे पिके लावणे टाळा.';

  @override
  String get tungro_rice =>
      'तांदळामधील टुंग्रो रोग हा हिरव्या पानांच्या उडत्या कीटकांद्वारे प्रसारित होणाऱ्या विषाणूमुळे होतो. टुंग्रोचे नियंत्रण करण्यासाठी प्रतिरोधक तांदूळ प्रकारांचा वापर करा आणि संक्रमित झाडे नष्ट करा. विषाणू प्रसारण कमी करण्यासाठी कीटकनाशकांचा वापर करा. तणांचे नियंत्रण यासारख्या योग्य क्षेत्र व्यवस्थापन पद्धती सुनिश्चित करा, कारण ते कीटकांसाठी पर्यायी यजमान होऊ शकतात. संक्रमित झाडे त्वरीत काढून टाका आणि नष्ट करा, जेणेकरून रोगाचा प्रसार मर्यादित राहील. अतिथी नसलेल्या पिकांसह पीक फेरपालट पाळण्याची शिफारस केली जाते जेणेकरून रोगाची पुनरावृत्ती कमी होईल. टुंग्रोचा इतिहास असलेल्या भागांमध्ये तांदळाची लागवड टाळा.';
}
